{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# PyMogwai Live Demo!\n",
    "\n",
    "## Initialization\n",
    "First, we need to import the mogwai library"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from mogwai.core.traversal import MogwaiGraphTraversalSource\n",
    "from mogwai.core.steps.statics import *\n",
    "from mogwai.parser import graphml_to_mogwaigraph"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then, load the graph!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "airroutes_path = \"tests/documents/air-routes-latest.graphml\"\n",
    "graph = graphml_to_mogwaigraph(airroutes_path, node_label_key=\"labelV\", \n",
    "            edge_label_key=\"labelE\", node_name_key=\"desc\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, create a traversal source"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "g = MogwaiGraphTraversalSource(graph)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Let's go on a holiday!\n",
    "We want to go on holiday, where can we go from germany?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Query: V -> Contains -> Has -> Out -> Out -> In -> Contains -> Values -> Dedup -> ToList\n",
      "Result: ['United States', 'Puerto Rico', 'Canada', 'United Kingdom', 'France', 'Finland', 'Japan', 'Singapore', 'United Arab Emirates', 'India'] total:  110\n"
     ]
    }
   ],
   "source": [
    "query = g.V().has_label(\"country\").has_name(\"Germany\")\\\n",
    "        .out(\"contains\")\\\n",
    "        .out(\"route\")\\\n",
    "        .in_(\"contains\")\\\n",
    "        .has_label(\"country\").name().dedup().to_list()\n",
    "print(\"Query:\",query.print_query())\n",
    "res = query.run()\n",
    "print(\"Result:\", res[:10], \"total: \", len(res))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Okay, that's a bit much. Let's see what's the farthest we can get without a layover"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: Argentina\n"
     ]
    }
   ],
   "source": [
    "query = g.V().has_label(\"country\").has_name(\"Germany\")\\\n",
    "        .out(\"contains\")\\\n",
    "        .outE(\"route\").as_(\"e\")\\\n",
    "        .inV()\\\n",
    "        .in_(\"contains\").has_label(\"country\").as_('dest')\\\n",
    "        .select('e').properties('dist').max_()\\\n",
    "        .select('dest').by('name').next()\n",
    "print(\"Result:\", query.run())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Well, that's nice. Let's go there! But from which airport are we departing?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Result: [['Frankfurt am Main', 'Argentina', 7141]]\n"
     ]
    }
   ],
   "source": [
    "query = g.V().has_label(\"country\").has_name(\"Germany\")\\\n",
    "            .out(\"contains\").as_('start')\\\n",
    "            .outE(\"route\").as_(\"e\")\\\n",
    "            .inV()\\\n",
    "            .in_(\"contains\").has_label(\"country\").as_('dest')\\\n",
    "            .select('e').properties('dist').as_('dist').max_().\\\n",
    "            select('start', 'dest', 'dist').to_list().by('name')\n",
    "res = query.run()\n",
    "print(\"Result:\",res)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Hmm, that's a bit far away from Aachen. Let's see where we can go from a nearby airport"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['Dusseldorf International Airport', 'Singapore'],\n",
       " ['Brussels Airport', 'Japan'],\n",
       " ['Brussels South Charleroi Airport', 'Hong Kong'],\n",
       " ['Brussels Airport', 'Hong Kong'],\n",
       " ['Brussels Airport', 'China']]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has_label(\"airport\").within(\"city\", [\"Brussels\", \"Maastricht\", \"Aachen\", \"Dusseldorf\"]).as_('start')\\\n",
    "            .outE(\"route\").as_(\"e\")\\\n",
    "            .inV()\\\n",
    "            .in_(\"contains\").has_label(\"country\").as_('dest')\\\n",
    "            .order(desc=True).by(select('e').properties('dist'))\\\n",
    "            .limit(5)\\\n",
    "            .select('start', 'dest').to_list().by('name').run()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Those flights are really long...\n",
    "I guess we have to accept layovers then. Where can we go within three hops if we want to depart from Maastricht Aachen Airport? We don't want a flight longer than 2000 miles."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['Alicante', 3],\n",
       " ['Alghero', 3],\n",
       " ['Trapani', 3],\n",
       " ['Girona', 3],\n",
       " ['Catania', 3],\n",
       " ['Kerkyra Island', 3],\n",
       " ['Heraklion', 3],\n",
       " ['Tenerife Island', 3],\n",
       " ['Bari', 3],\n",
       " ['Porto', 3],\n",
       " ['Faro', 3],\n",
       " ['Zakynthos', 3],\n",
       " ['Antalya', 3],\n",
       " ['Palma De Mallorca', 3],\n",
       " ['Istanbul', 3],\n",
       " ['Luqa', 3],\n",
       " ['Kos Island', 3],\n",
       " ['Geneva', 5],\n",
       " ['Liverpool', 5],\n",
       " ['Nottingham', 5],\n",
       " ['London', 5],\n",
       " ['Shannon', 5],\n",
       " ['Manchester', 5],\n",
       " ['Brussels', 5],\n",
       " ['Zurich', 5],\n",
       " ['Kalymnos Island', 5],\n",
       " ['Barcelona', 5],\n",
       " ['Rome', 5],\n",
       " ['Dublin', 5],\n",
       " ['Paris', 5],\n",
       " ['London', 5],\n",
       " ['London', 5],\n",
       " ['Berlin', 5],\n",
       " ['Paris', 5],\n",
       " ['Madrid', 5],\n",
       " ['Nice', 5],\n",
       " ['Luxembourg', 5],\n",
       " ['Lyon', 5],\n",
       " ['Cork', 5],\n",
       " ['Basle', 5],\n",
       " ['Sevilla', 5],\n",
       " ['Bristol', 5],\n",
       " ['Leeds', 5],\n",
       " ['Malaga', 5],\n",
       " ['Milan', 5],\n",
       " ['Gran Canaria', 5],\n",
       " ['Lisbon', 5],\n",
       " ['Doncaster', 5],\n",
       " ['Nantes', 5],\n",
       " ['Bologna', 5],\n",
       " ['Pisa', 5],\n",
       " ['Naples', 5],\n",
       " ['Stuttgart', 5],\n",
       " ['Bilbao', 5],\n",
       " ['London', 5],\n",
       " ['Rostock', 5],\n",
       " ['Kaunas', 5],\n",
       " ['Ostrava', 5],\n",
       " ['Athens', 5],\n",
       " ['Moscow', 5],\n",
       " ['Glasgow', 5],\n",
       " ['Edinburgh', 5],\n",
       " ['Stockholm', 5],\n",
       " ['Cologne', 5],\n",
       " ['Hamburg', 5],\n",
       " ['Vienna', 5],\n",
       " ['Amsterdam', 5],\n",
       " ['Frankfurt', 5],\n",
       " ['Châlons/Vatry', 5],\n",
       " ['Saint-Étienne/Bouthéon', 5],\n",
       " ['Munich', 5],\n",
       " ['Paderborn', 5],\n",
       " ['Dusseldorf', 5],\n",
       " ['Bergamo', 5],\n",
       " ['Rygge', 5],\n",
       " ['Leipzig', 5],\n",
       " ['Nuremberg', 5],\n",
       " ['Culleredo', 5],\n",
       " ['Kraków', 5],\n",
       " ['Erfurt', 5],\n",
       " ['Birmingham', 5],\n",
       " ['Rotterdam', 5],\n",
       " ['Hannover', 5],\n",
       " ['Rhodes', 5],\n",
       " ['Riga', 5],\n",
       " ['Salzburg', 5],\n",
       " ['Cardiff', 5],\n",
       " ['Belfast', 5],\n",
       " ['Verona', 5],\n",
       " ['Tel Aviv', 5],\n",
       " ['Warsaw', 5],\n",
       " ['Larnaca', 5],\n",
       " ['Moscow', 5],\n",
       " ['Kuwait', 5],\n",
       " ['Bordeaux/Mérignac', 5],\n",
       " ['Dresden', 5],\n",
       " ['St. Petersburg', 5],\n",
       " ['Toulouse/Blagnac', 5],\n",
       " ['Kiev', 5],\n",
       " ['Beirut', 5],\n",
       " ['Marseille', 5],\n",
       " ['Moscow', 5],\n",
       " ['Tallinn', 5],\n",
       " ['Newcastle', 5],\n",
       " ['Granada', 5],\n",
       " ['Memmingen', 5],\n",
       " ['Hahn', 5],\n",
       " ['Lille/Lesquin', 5],\n",
       " ['Santander', 5],\n",
       " ['Vigo', 5],\n",
       " ['Ranón', 5],\n",
       " ['Beauvais/Tillé', 5],\n",
       " ['Bournemouth', 5],\n",
       " ['Brussels', 5],\n",
       " ['Grimsby', 5],\n",
       " ['Lajes', 5],\n",
       " ['Ponta Delgada', 5],\n",
       " ['Valencia', 5],\n",
       " ['Santiago de Compostela', 5],\n",
       " ['Fuerteventura Island', 5],\n",
       " ['Charleston', 5],\n",
       " ['Sta Cruz de la Palma, La Palma Island', 5],\n",
       " ['Blackpool', 5],\n",
       " ['Baden-Baden', 5],\n",
       " ['Glasgow', 5],\n",
       " ['Prague', 5],\n",
       " ['Vitoria', 5],\n",
       " ['El Hierro Island', 5],\n",
       " ['Zweibrücken', 5],\n",
       " ['Saarbrücken', 5],\n",
       " ['Zaragoza', 5],\n",
       " ['Dole/Tavaux', 5],\n",
       " ['Weeze', 5],\n",
       " ['Billund', 5],\n",
       " ['Belfast', 5],\n",
       " ['Eindhoven', 5],\n",
       " ['Aberdeen', 5],\n",
       " ['Southampton', 5],\n",
       " ['Bremen', 5],\n",
       " ['Friedrichshafen', 5],\n",
       " ['Münster', 5],\n",
       " ['Warsaw', 5],\n",
       " ['Killarney', 5],\n",
       " ['Exeter', 5],\n",
       " ['Southend', 5],\n",
       " ['Dortmund', 5],\n",
       " ['Newquay', 5],\n",
       " ['Katowice', 5],\n",
       " ['Bratislava', 5],\n",
       " ['Kithira Island', 5],\n",
       " ['Palermo', 5],\n",
       " ['Souda', 5],\n",
       " ['Copenhagen', 5],\n",
       " ['Budapest', 5],\n",
       " ['Oslo', 5],\n",
       " ['Gothenburg', 5],\n",
       " ['Clermont-Ferrand/Auvergne', 5],\n",
       " ['Brest/Guipavas', 5],\n",
       " ['Brive', 5],\n",
       " ['Marrakech', 5],\n",
       " ['Casablanca', 5],\n",
       " ['Wroclaw', 5],\n",
       " ['Funchal', 5],\n",
       " ['Almería', 5],\n",
       " ['Tours/Val de Loire (Loire Valley)', 5],\n",
       " ['Carcassonne/Salvaza', 5],\n",
       " ['La Rochelle/Île de Ré', 5],\n",
       " ['Strasbourg', 5],\n",
       " ['Cagliari', 5],\n",
       " ['Roma', 5],\n",
       " ['Montpellier/Méditerranée', 5],\n",
       " ['Helsinki', 5],\n",
       " ['Groningen', 5],\n",
       " ['Ostend', 5],\n",
       " ['Aarhus', 5],\n",
       " ['Derry', 5],\n",
       " ['London', 5],\n",
       " ['Venice', 5],\n",
       " ['Menorca', 5],\n",
       " ['Thessaloniki', 5],\n",
       " ['Ibiza', 5],\n",
       " ['Rabat', 5],\n",
       " ['Poznań', 5],\n",
       " ['Bucharest', 5],\n",
       " ['Milan', 5],\n",
       " ['Turin', 5],\n",
       " ['Visby', 5],\n",
       " ['Pescara', 5],\n",
       " ['Ancona', 5],\n",
       " ['Lampedusa', 5],\n",
       " ['Firenze', 5],\n",
       " ['Vilnius', 5],\n",
       " ['Lamezia Terme', 5],\n",
       " ['Lviv', 5],\n",
       " ['Brindisi', 5],\n",
       " ['Venice', 5],\n",
       " ['Cuneo', 5],\n",
       " ['Parma', 5],\n",
       " ['Trieste', 5],\n",
       " ['Stockholm / Nyköping', 5],\n",
       " ['Gothenburg', 5],\n",
       " ['Torp', 5],\n",
       " ['Perugia', 5],\n",
       " ['Oradea', 5],\n",
       " ['Lappeenranta', 5],\n",
       " ['Kiev', 5],\n",
       " ['Tampere / Pirkkala', 5],\n",
       " ['Skellefteå', 5],\n",
       " ['Genoa', 5],\n",
       " ['Pantelleria', 5],\n",
       " ['Preveza/Lefkada', 5],\n",
       " ['Kefallinia Island', 5],\n",
       " ['Voronezh', 5],\n",
       " ['Krasnodar', 5],\n",
       " ['Rennes/Saint-Jacques', 5],\n",
       " ['Linz', 5],\n",
       " ['Norwich', 5],\n",
       " ['Nizhny Novgorod', 5],\n",
       " ['Pardubice', 5],\n",
       " ['Paros Island', 5],\n",
       " ['Liège', 5],\n",
       " ['Cluj-Napoca', 5],\n",
       " ['Graz', 5],\n",
       " ['Lublin', 5],\n",
       " ['Tivat', 5],\n",
       " ['Sofia', 5],\n",
       " ['Tirana', 5],\n",
       " ['Sharm el-Sheikh', 5],\n",
       " ['Dubrovnik', 5],\n",
       " ['Dubai', 5],\n",
       " ['Debrecen', 5],\n",
       " ['Benghazi', 5],\n",
       " ['Zagreb', 5],\n",
       " ['Doha', 5],\n",
       " ['Comiso', 5],\n",
       " ['Paphos', 5],\n",
       " ['Istanbul', 5],\n",
       " ['Tripoli', 5],\n",
       " ['Tarbes/Lourdes/Pyrénées', 5],\n",
       " ['Skopje', 5],\n",
       " ['Belgrade', 5],\n",
       " ['Minsk', 5],\n",
       " ['Bodrum', 5],\n",
       " ['Dalaman', 5],\n",
       " ['İzmir', 5],\n",
       " ['Ljubljana', 5],\n",
       " ['Hurghada', 5],\n",
       " ['Aalborg', 5],\n",
       " ['Prishtina', 5],\n",
       " ['Konya', 5],\n",
       " ['Ad Dammam', 5],\n",
       " ['Khartoum', 5],\n",
       " ['Alexandria', 5],\n",
       " ['Samara', 5],\n",
       " ['Podgorica', 5],\n",
       " ['Chişinău', 5],\n",
       " ['Ankara', 5],\n",
       " ['Kayseri', 5],\n",
       " ['Varna', 5],\n",
       " ['Sharjah', 5],\n",
       " ['Tbilisi', 5],\n",
       " ['Atyrau', 5],\n",
       " ['Arbil', 5],\n",
       " ['Jeddah', 5],\n",
       " ['Tunis', 5],\n",
       " ['Abu Dhabi', 5],\n",
       " ['Manama', 5],\n",
       " ['Cairo', 5],\n",
       " ['Tehran', 5],\n",
       " ['Riyadh', 5],\n",
       " ['Baku', 5],\n",
       " ['Ashgabat', 5],\n",
       " ['Algiers', 5],\n",
       " ['Amman', 5],\n",
       " ['Annabah', 5],\n",
       " ['Bergen', 5],\n",
       " ['Stavanger', 5],\n",
       " ['Trondheim', 5],\n",
       " ['Växjö', 5],\n",
       " ['Kjevik', 5],\n",
       " ['Ålesund', 5],\n",
       " ['Reykjavik', 5],\n",
       " ['Tenerife', 5],\n",
       " ['Karlstad', 5],\n",
       " ['Umeå', 5],\n",
       " ['Stockholm / Västerås', 5],\n",
       " ['Årø', 5],\n",
       " ['Karmøy', 5],\n",
       " ['Tlemcen', 5],\n",
       " ['Oran', 5],\n",
       " ['Turku', 5],\n",
       " ['Ivano-Frankivsk', 5],\n",
       " ['Constantine', 5],\n",
       " ['Yerevan', 5],\n",
       " ['Kassel', 5],\n",
       " ['Lübeck', 5],\n",
       " ['Valladolid', 5],\n",
       " ['Oulu / Oulunsalo', 5],\n",
       " ['Lleida', 5],\n",
       " ['Cuxhaven', 5],\n",
       " ['Caen/Carpiquet', 5],\n",
       " ['Nador', 5],\n",
       " ['Jerez de la Forntera', 5],\n",
       " ['Reus', 5],\n",
       " ['Nicosia', 5],\n",
       " ['Perm', 5],\n",
       " ['Chelyabinsk', 5],\n",
       " ['Bydgoszcz', 5],\n",
       " ['Rostov-on-Don', 5],\n",
       " ['Sulaymaniyah', 5],\n",
       " ['Baghdad', 5],\n",
       " ['Yekaterinburg', 5],\n",
       " ['Goleniow', 5],\n",
       " ['Adana', 5],\n",
       " ['Makhachkala', 5],\n",
       " ['Trabzon', 5],\n",
       " ['Samsun', 5],\n",
       " ['Łódź', 5],\n",
       " ['Zhukovsky', 5],\n",
       " ['Kazan', 5],\n",
       " ['Grozny', 5],\n",
       " ['Aqaba', 5],\n",
       " ['Urmia', 5],\n",
       " ['Kermanshah', 5],\n",
       " ['Edremit', 5],\n",
       " ['Isparta', 5],\n",
       " ['Hatay', 5],\n",
       " ['Şanlıurfa', 5],\n",
       " ['Bingöl', 5],\n",
       " ['Mardin', 5],\n",
       " ['Agri', 5],\n",
       " ['Kahramanmaraş', 5],\n",
       " ['Muş', 5],\n",
       " ['Batman', 5],\n",
       " ['Van', 5],\n",
       " ['Kars', 5],\n",
       " ['Erzurum', 5],\n",
       " ['Adıyaman', 5],\n",
       " ['Erzincan', 5],\n",
       " ['Iğdır', 5],\n",
       " ['Ganja', 5],\n",
       " ['Sirnak', 5],\n",
       " ['Kherson', 5],\n",
       " ['Nalchik', 5],\n",
       " ['Mosul', 5],\n",
       " ['Sinop', 5],\n",
       " ['Kutahya', 5],\n",
       " ['Aktau', 5],\n",
       " ['Nizhnekamsk', 5],\n",
       " ['Samarkand', 5],\n",
       " ['Tyumen', 5],\n",
       " ['Astrakhan', 5],\n",
       " ['Sochi', 5],\n",
       " ['Zaporizhia', 5],\n",
       " ['Batumi', 5],\n",
       " ['Nakhchivan', 5],\n",
       " ['Hakkari', 5],\n",
       " ['Diyarbakir', 5],\n",
       " ['Çanakkale', 5],\n",
       " ['Volgograd', 5],\n",
       " ['Kharkiv', 5],\n",
       " ['Najaf', 5],\n",
       " ['Basrah', 5],\n",
       " ['Tabriz', 5],\n",
       " ['Mashhad', 5],\n",
       " ['Isfahan', 5],\n",
       " ['Yenbo', 5],\n",
       " ['Ta’if', 5],\n",
       " ['Medina', 5],\n",
       " ['Buraidah', 5],\n",
       " ['Shiraz', 5],\n",
       " ['Elazığ', 5],\n",
       " ['Sarajevo', 5],\n",
       " ['Dnipropetrovsk', 5],\n",
       " ['Nevşehir', 5],\n",
       " ['Malatya', 5],\n",
       " ['Sivas', 5],\n",
       " ['Amasya', 5],\n",
       " ['Kastamonu', 5],\n",
       " ['Gaziantep', 5],\n",
       " ['Constanţa', 5],\n",
       " ['Košice', 5],\n",
       " ['Misratah', 5],\n",
       " ['Ufa', 5],\n",
       " ['Donetsk', 5],\n",
       " ['Gazipaşa', 5],\n",
       " ['Odessa', 5],\n",
       " ['Asmara', 5],\n",
       " ['Ordu/Giresun', 5],\n",
       " ['Denizli', 5],\n",
       " ['Uşak', 5],\n",
       " ['Bern', 5],\n",
       " ['Ohrid', 5],\n",
       " ['Innsbruck', 5],\n",
       " ['Tripoli', 5],\n",
       " ['Siirt', 5],\n",
       " ['Lanzarote Island', 7],\n",
       " ['Tangier', 7],\n",
       " ['Sibiu', 7],\n",
       " ['Nea Anchialos', 7],\n",
       " ['Timişoara', 7],\n",
       " ['Zadar', 7],\n",
       " ['Pula', 7],\n",
       " ['Burgas', 7],\n",
       " ['Split', 7],\n",
       " ['Agadir', 7],\n",
       " ['Toulon/Hyères/Le Palyvestre', 7],\n",
       " ['Oujda', 7],\n",
       " ['Figari Sud-Corse', 7],\n",
       " ['Biarritz/Anglet/Bayonne', 7],\n",
       " ['Pau/Pyrénées (Uzein)', 7],\n",
       " ['Monastir', 7],\n",
       " ['Patras', 7],\n",
       " ['Djerba', 7],\n",
       " ['Kalamata', 7],\n",
       " ['Ajaccio/Napoléon Bonaparte', 7],\n",
       " ['Bastia/Poretta', 7],\n",
       " ['Fes', 7],\n",
       " ['Plovdiv', 7],\n",
       " ['San Javier', 7],\n",
       " ['Saint Peter Port', 7],\n",
       " ['Saint Helier', 7],\n",
       " ['Rzeszów', 7],\n",
       " ['Castletown', 7],\n",
       " ['Eilat', 7],\n",
       " ['Nis', 7],\n",
       " ['Kutaisi', 7],\n",
       " ['Banja Luka', 7],\n",
       " ['Calvi/Sainte-Catherine', 7],\n",
       " ['Béziers/Vias', 7],\n",
       " ['Gdańsk', 7],\n",
       " ['Târgu Mureş', 7],\n",
       " ['Iaşi', 7],\n",
       " ['Crotone', 7],\n",
       " ['Chernivtsi', 7],\n",
       " ['Craiova', 7],\n",
       " ['Arad', 7],\n",
       " ['Mostar', 7],\n",
       " ['Brno', 7],\n",
       " ['Karpathos Island', 7],\n",
       " ['Olbia', 7],\n",
       " ['Reggio Calabria', 7],\n",
       " ['Valladolises', 7],\n",
       " ['Vila Baleira', 7],\n",
       " ['Kittila', 7],\n",
       " ['Östersund', 7],\n",
       " ['Rovaniemi', 7],\n",
       " ['Ivalo', 7],\n",
       " ['Limoges/Bellegarde', 7],\n",
       " ['Klagenfurt am Wörthersee', 7],\n",
       " ['Grenoble', 7],\n",
       " ['Biskra', 7],\n",
       " ['Perpignan/Rivesaltes', 7],\n",
       " ['Batna', 7],\n",
       " ['Sfax', 7],\n",
       " ['Tuzla', 7],\n",
       " ['Gibraltar', 7],\n",
       " ['Tromsø', 7],\n",
       " ['Enfidha', 7],\n",
       " ['Hassi Messaoud', 7],\n",
       " ['Inverness', 7],\n",
       " ['Rijeka', 7],\n",
       " ['Santorini Island', 7],\n",
       " ['Mykonos Island', 7],\n",
       " ['Antwerp', 7],\n",
       " ['Bergerac/Roumanière', 7],\n",
       " ['Kuusamo', 7],\n",
       " ['Waterford', 7],\n",
       " ['Mytilene', 7],\n",
       " ['Melilla', 7],\n",
       " ['Béjaïa', 7],\n",
       " ['Poitiers/Biard', 7],\n",
       " ['Metz / Nancy', 7],\n",
       " ['Sétif', 7],\n",
       " ['Le Havre/Octeville', 7],\n",
       " ['Lorient/Lann/Bihoué', 7],\n",
       " ['Angelsey', 7],\n",
       " ['Ouarzazate', 7],\n",
       " ['Essaouira', 7],\n",
       " ['Praia', 7],\n",
       " ['Velas', 7],\n",
       " ['Santa Cruz das Flores', 7],\n",
       " ['Pico Island', 7],\n",
       " ['Horta', 7],\n",
       " ['Vila do Porto', 7],\n",
       " ['Rodez/Marcillac', 7],\n",
       " ['Nîmes/Garons', 7],\n",
       " ['Stockholm', 7],\n",
       " ['Eskişehir', 7],\n",
       " ['Brač Island', 7],\n",
       " ['Lugano', 7],\n",
       " ['Marina  Di Campo', 7],\n",
       " ['Westerland', 7],\n",
       " ['Heringsdorf', 7],\n",
       " ['Samos Island', 7],\n",
       " ['Chambéry/Aix-les-Bains', 7],\n",
       " ['Lerwick', 7],\n",
       " ['Stornoway', 7],\n",
       " ['Orkney Islands', 7],\n",
       " ['Osijek', 7],\n",
       " ['Kavala', 7],\n",
       " ['Rimini', 7],\n",
       " ['Crete Island', 7],\n",
       " ['Norrköping', 7],\n",
       " ['Maribor', 7],\n",
       " ['Chios Island', 7],\n",
       " ['Linköping', 7],\n",
       " ['Durham', 7],\n",
       " ['Dundee', 7],\n",
       " ['Uralsk', 7],\n",
       " ['Jönköping', 7],\n",
       " ['Pamplona', 7],\n",
       " ['Altenrhein', 7],\n",
       " ['Marsa Alam', 7],\n",
       " ['Malmö', 7],\n",
       " ['Kraljevo', 7],\n",
       " ['Kaliningrad', 7],\n",
       " ['Saratov', 7],\n",
       " ['Hondarribia', 7],\n",
       " ['Logroño', 7],\n",
       " ['Badajoz', 7],\n",
       " ['Dakar', 7],\n",
       " ['Dinard/Pleurtuit/Saint-Malo', 7],\n",
       " ['Dakhla', 7],\n",
       " ['Quimper/Pluguffan', 7],\n",
       " ['Lannion', 7],\n",
       " ['Le Puy/Loudes', 7],\n",
       " ['Castres/Mazamet', 7],\n",
       " ['Périgueux/Bassillac', 7],\n",
       " ['Agen/La Garenne', 7],\n",
       " ['Tozeur', 7],\n",
       " ['Aurillac', 7],\n",
       " ['Szcytno', 7],\n",
       " ['Bolzano', 7],\n",
       " ['Bacău', 7],\n",
       " ['Donegal', 7],\n",
       " ['Burgos', 7],\n",
       " ['León', 7],\n",
       " ['Salamanca', 7],\n",
       " ['Satu Mare', 7],\n",
       " ['Goulimime', 7],\n",
       " ['Nouadhibou', 7],\n",
       " ['El Aaiún', 7],\n",
       " ['Banjul', 7],\n",
       " ['Nouakchott', 7],\n",
       " ['Bissau', 7],\n",
       " ['Senou', 7],\n",
       " ['São Pedro', 7],\n",
       " ['Rabil', 7],\n",
       " ['Espargos', 7],\n",
       " ['Hawarden', 7],\n",
       " ['Skiathos', 7],\n",
       " ['Tetuan', 7],\n",
       " ['Dabaa', 7],\n",
       " ['Châteauroux/Déols', 7],\n",
       " ['Luxor', 7],\n",
       " ['Suceava', 7],\n",
       " ['Barnaul', 7],\n",
       " ['Castellón de La Plana', 7],\n",
       " [\"St. Mary's\", 7],\n",
       " ['Astana', 7],\n",
       " ['Eilat', 7],\n",
       " ['Mannheim', 7],\n",
       " ['Sleptsovskaya', 7],\n",
       " ['Bryansk', 7],\n",
       " ['Ulyanovsk', 7],\n",
       " ['Naryan Mar', 7],\n",
       " ['Saransk', 7],\n",
       " ['Orenburg', 7],\n",
       " ['Cheboksary', 7],\n",
       " ['Bugulma', 7],\n",
       " ['Syktyvkar', 7],\n",
       " ['Ukhta', 7],\n",
       " ['Kursk', 7],\n",
       " ['Belgorod', 7],\n",
       " ['Yaroslavl', 7],\n",
       " ['Novy Urengoy', 7],\n",
       " ['Kirov', 7],\n",
       " ['Izhevsk', 7],\n",
       " ['Cherepovets', 7],\n",
       " ['Mineralnyye Vody', 7],\n",
       " ['Urgench', 7],\n",
       " ['Novosibirsk', 7],\n",
       " ['Beslan', 7],\n",
       " ['Gelendzhik', 7],\n",
       " ['Anapa', 7],\n",
       " ['Norilsk', 7],\n",
       " ['Omsk', 7],\n",
       " ['Murmansk', 7],\n",
       " ['Archangelsk', 7],\n",
       " ['Simferopol', 7],\n",
       " ['Gyumri', 7],\n",
       " ['Lankaran', 7],\n",
       " ['Karaganda', 7],\n",
       " ['Karlovy Vary', 7],\n",
       " ['Palanga', 7],\n",
       " ['Vinnitsa', 7],\n",
       " ['Sevastopol', 7],\n",
       " ['Tashkent', 7],\n",
       " ['Dijon/Longvic', 7],\n",
       " ['Hamburg', 7],\n",
       " ['Skiros Island', 7],\n",
       " ['Limnos Island', 7],\n",
       " ['Kuopio / Siilinjärvi', 7],\n",
       " ['Kokkola / Kruunupyy', 7],\n",
       " ['Kajaani', 7],\n",
       " ['Kemi / Tornio', 7],\n",
       " ['Jyväskylän Maalaiskunta', 7],\n",
       " ['Joensuu / Liperi', 7],\n",
       " ['Tartu', 7],\n",
       " ['Mariehamn', 7],\n",
       " ['Pori', 7],\n",
       " ['Vaasa', 7],\n",
       " ['Savonlinna', 7],\n",
       " ['Enontekio', 7],\n",
       " ['Syros Island', 7],\n",
       " ['Astypalaia Island', 7],\n",
       " ['Naxos Island', 7],\n",
       " ['Milos Island', 7],\n",
       " ['Leros Island', 7],\n",
       " ['Kozani', 7],\n",
       " ['Kastoria', 7],\n",
       " ['Ioannina', 7],\n",
       " ['Ikaria Island', 7],\n",
       " ['Alexandroupolis', 7],\n",
       " ['Tel Aviv', 7],\n",
       " ['Eilat', 7],\n",
       " ['Addis Ababa', 7],\n",
       " ['Damascus', 7],\n",
       " ['Al Ain', 7],\n",
       " ['Sohag', 7],\n",
       " ['Assiut', 7],\n",
       " ['Jebel Ali', 7],\n",
       " ['Lahore', 7],\n",
       " ['Islamabad', 7],\n",
       " ['Muscat', 7],\n",
       " ['Mumbai', 7],\n",
       " ['New Delhi', 7],\n",
       " ['Vasco da Gama', 7],\n",
       " ['Bishkek', 7],\n",
       " ['Riyan', 7],\n",
       " ['Sialkot', 7],\n",
       " ['Peshawar', 7],\n",
       " ['Lamerd', 7],\n",
       " ['Lar', 7],\n",
       " ['Kabul', 7],\n",
       " [\"Sana'a\", 7],\n",
       " ['Ahmedabad', 7],\n",
       " ['Ahwaz', 7],\n",
       " ['Wick', 7],\n",
       " ['Port Ellen', 7],\n",
       " ['Campbeltown', 7],\n",
       " ['Osh', 7],\n",
       " ['Kzyl-Orda', 7],\n",
       " ['Surgut', 7],\n",
       " ['Nizhnevartovsk', 7],\n",
       " ['Khanty-Mansiysk', 7],\n",
       " ['Salekhard', 7],\n",
       " ['Magnitogorsk', 7],\n",
       " ['Stavropol', 7],\n",
       " ['Kostanay', 7],\n",
       " ['Novokuznetsk', 7],\n",
       " ['Tomsk', 7],\n",
       " ['Kemerovo', 7],\n",
       " ['Almaty', 7],\n",
       " ['Bukhara', 7],\n",
       " ['Ulyanovsk', 7],\n",
       " ['Dushanbe', 7],\n",
       " ['Balemartine', 7],\n",
       " ['Eoligarry', 7],\n",
       " ['Balivanich', 7],\n",
       " ['Vorkuta', 7],\n",
       " ['Termez', 7],\n",
       " ['Khanabad', 7],\n",
       " ['Navoi', 7],\n",
       " ['Nukus', 7],\n",
       " ['Fergana', 7],\n",
       " ['Andizhan', 7],\n",
       " ['Kurgan-Tyube', 7],\n",
       " ['Khudzhand', 7],\n",
       " ['Kulyab', 7],\n",
       " ['Kurgan', 7],\n",
       " ['Noyabrsk', 7],\n",
       " ['Namangan', 7],\n",
       " ['Gomel', 7],\n",
       " ['Lipetsk', 7],\n",
       " ['Penza', 7],\n",
       " ['Orsk', 7],\n",
       " ['Nadym', 7],\n",
       " ['Gabala', 7],\n",
       " ['Aktyuinsk', 7],\n",
       " ['Pavlodar', 7],\n",
       " ['Ust Kamenogorsk', 7],\n",
       " ['Taraz', 7],\n",
       " ['Kokshetau', 7],\n",
       " ['Shymkent', 7],\n",
       " ['Beloyarskiy', 7],\n",
       " ['Elista', 7],\n",
       " ['Taganrog', 7],\n",
       " ['Gorno-Altaysk', 7],\n",
       " ['Petrozavodsk', 7],\n",
       " ['Apatity', 7],\n",
       " ['Pajala', 7],\n",
       " ['Torsby', 7],\n",
       " ['Kuressaare', 7],\n",
       " ['Karup', 7],\n",
       " ['Kastelorizo Island', 7],\n",
       " ['Sovetskiy', 7],\n",
       " ['Chlef', 7],\n",
       " ['Augsburg', 7],\n",
       " ['Kaluga', 7],\n",
       " ['Tambov', 7],\n",
       " ['Zonguldak', 7],\n",
       " ['Deauville', 7],\n",
       " ['Vagar', 7],\n",
       " ['Sønderborg', 7],\n",
       " ['Rønne', 7],\n",
       " ['Sundsvall/ Härnösand', 7],\n",
       " ['Arvidsjaur', 7],\n",
       " ['Ängelholm', 7],\n",
       " ['Luleå', 7],\n",
       " ['Hagfors', 7],\n",
       " ['Ronneby', 7],\n",
       " ['Vilhelmina', 7],\n",
       " ['Kiruna', 7],\n",
       " ['Örnsköldsvik', 7],\n",
       " ['Lycksele', 7],\n",
       " ['Kramfors / Sollefteå', 7],\n",
       " ['Gällivare', 7],\n",
       " ['Sveg', 7],\n",
       " ['Halmstad', 7],\n",
       " ['Kalmar', 7],\n",
       " ['Kristianstad', 7],\n",
       " ['Mora', 7],\n",
       " ['Freetown', 7],\n",
       " ['Ouagadougou', 7],\n",
       " ['Bouarfa', 7],\n",
       " ['Al Hoceima', 7],\n",
       " ['Zouérate', 7],\n",
       " ['Conakry', 7],\n",
       " ['Monrovia', 7],\n",
       " ['Niamey', 7],\n",
       " ['Abidjan', 7],\n",
       " ['Santa Cruz da Graciosa', 7],\n",
       " ['Esbjerg', 7],\n",
       " ['Baia Mare', 7],\n",
       " ['Uzhhorod', 7],\n",
       " ['Kvernberget', 7],\n",
       " ['Kufra', 7],\n",
       " ['Hyderabad', 7],\n",
       " ['Jaipur', 7],\n",
       " ['Karachi', 7],\n",
       " ['Calicut', 7],\n",
       " ['Kathmandu', 7],\n",
       " ['Bengaluru', 7],\n",
       " ['Chennai', 7],\n",
       " ['Malé', 7],\n",
       " ['Madurai', 7],\n",
       " ['Faisalabad', 7],\n",
       " ['Mogadishu', 7],\n",
       " ['Chandigarh', 7],\n",
       " ['Amritsar', 7],\n",
       " ['Sir Bani Yas Island', 7],\n",
       " ['Lucknow', 7],\n",
       " ['Al Ahsa', 7],\n",
       " ['Abha', 7],\n",
       " ['Kandahar', 7],\n",
       " ['Gheshm', 7],\n",
       " ['Djibouti City', 7],\n",
       " ['Berbera', 7],\n",
       " [\"Ha'il\", 7],\n",
       " ['Tiruchirappally', 7],\n",
       " ['Trivandrum', 7],\n",
       " ['Cochin', 7],\n",
       " ['Aden', 7],\n",
       " ['Pune', 7],\n",
       " ['Mangalore', 7],\n",
       " ['Multan', 7],\n",
       " ['Salalah', 7],\n",
       " ['Abu Dhabi', 7],\n",
       " ['Zahedan', 7],\n",
       " ['Tabuk', 7],\n",
       " ['Bandar Abbas', 7],\n",
       " ['Bandar Lengeh', 7],\n",
       " ['Kish Island', 7],\n",
       " ['Bushehr', 7],\n",
       " ['Hodeida', 7],\n",
       " ['Tamanrasset', 7],\n",
       " ['Guemar', 7],\n",
       " ['Ouargla', 7],\n",
       " ['Touggourt', 7],\n",
       " ['In Salah', 7],\n",
       " ['Ghardaïa', 7],\n",
       " ['Adrar', 7],\n",
       " ['El Bayadh', 7],\n",
       " ['Mascara', 7],\n",
       " ['Tiaret', 7],\n",
       " [\"Hassi R'Mel\", 7],\n",
       " ['Tébessi', 7],\n",
       " ['Mecheria', 7],\n",
       " ['Djanet', 7],\n",
       " ['Al Bayda', 7],\n",
       " ['Tobruk', 7],\n",
       " ['Sirt', 7],\n",
       " ['Gabès', 7],\n",
       " ['Ghadames', 7],\n",
       " ['Ghat', 7],\n",
       " ['Ubari', 7],\n",
       " ['Ürümqi', 7],\n",
       " ['Al Ula', 7],\n",
       " [\"Ta'izz\", 7],\n",
       " ['Wadi al-Dawasir', 7],\n",
       " ['Turaif', 7],\n",
       " ['Al-Jawf', 7],\n",
       " ['Sharurah', 7],\n",
       " ['Arar', 7],\n",
       " ['Rafha', 7],\n",
       " ['Qaisumah', 7],\n",
       " ['Guriat', 7],\n",
       " ['Jizan', 7],\n",
       " ['Dawadmi', 7],\n",
       " ['Bisha', 7],\n",
       " ['Al Baha', 7],\n",
       " ['Nejran', 7],\n",
       " ['Port Sudan', 7],\n",
       " ['Aswan', 7],\n",
       " ['Al Wajh', 7],\n",
       " ['Nairobi', 7],\n",
       " ['Sayun', 7],\n",
       " ['Ras Al Khaimah', 7],\n",
       " ['Mazar-i-Sharif Airport', 7],\n",
       " ['Herat', 7],\n",
       " ['Kannur', 7],\n",
       " ['Sohar', 7],\n",
       " ['Naqpur', 7],\n",
       " ['Mirpur Khas', 7],\n",
       " ['Leirvik', 7],\n",
       " ['Sogndal', 7],\n",
       " ['Sandane', 7],\n",
       " ['Longyearbyen', 7],\n",
       " ['Røros', 7],\n",
       " ['Ørsta', 7],\n",
       " ['Ørland', 7],\n",
       " ['Kirkenes', 7],\n",
       " ['Alstahaug', 7],\n",
       " ['Leirin', 7],\n",
       " ['Evenes', 7],\n",
       " ['Målselv', 7],\n",
       " ['Bodø', 7],\n",
       " ['Brønnøy', 7],\n",
       " ['Førde', 7],\n",
       " ['Alta', 7],\n",
       " ['Florø', 7],\n",
       " ['Svolvær', 7],\n",
       " ['Leknes', 7],\n",
       " ['Hadsel', 7],\n",
       " ['Borlange', 7],\n",
       " ['Rahim Yar Khan', 7],\n",
       " ['Juba', 7],\n",
       " ['Kano', 7],\n",
       " ['Akureyri', 7],\n",
       " ['Nuuk', 7],\n",
       " ['Saint Anne', 7],\n",
       " ['Avignon/Caumont', 7],\n",
       " ['Alajero, La Gomera Island', 7],\n",
       " ['Rørvik', 7],\n",
       " ['Mo i Rana', 7],\n",
       " ['Namsos', 7],\n",
       " ['Mosjøen', 7],\n",
       " ['Geiteryggen', 7],\n",
       " ['Béchar', 7],\n",
       " ['Kerman', 7],\n",
       " ['Krasnoyarsk', 7],\n",
       " ['Kogalym', 7],\n",
       " ['Uray', 7],\n",
       " ['Nyagan', 7],\n",
       " ['Çorlu', 7],\n",
       " ['Kosekoy', 7],\n",
       " ['Tehran', 7],\n",
       " ['Zabol', 7],\n",
       " ['Yazd', 7],\n",
       " ['Ardabil', 7],\n",
       " ['Sari', 7],\n",
       " ['Ramsar', 7],\n",
       " ['Now Shahr', 7],\n",
       " ['Gorgan', 7],\n",
       " ['Birjand', 7],\n",
       " ['Hamadan', 7],\n",
       " ['Quetta', 7],\n",
       " ['Rasht', 7],\n",
       " ['Abadan', 7],\n",
       " ['Chabahar', 7],\n",
       " ['Asalouyeh', 7],\n",
       " ['Sirri Island', 7],\n",
       " ['Turbat', 7],\n",
       " ['Dera Ghazi Khan', 7],\n",
       " ['Coimbatore', 7],\n",
       " ['Varanasi', 7],\n",
       " ['Magdalla', 7],\n",
       " ['Bandar Mahshahr', 7],\n",
       " ['Nyala', 7],\n",
       " ['Geneina', 7],\n",
       " ['El Fasher', 7],\n",
       " [\"N'Djamena\", 7],\n",
       " ['Grosetto', 7]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.V().has_label('airport').has_property(\"city\", \"Maastricht\").as_('start')\\\n",
    "    .repeat(\n",
    "        outE('route').as_('e')\\\n",
    "        .inV().filter_(\n",
    "            select('e').properties('dist').is_(lte(2000))\n",
    "        ).simple_path()\n",
    "    ).times(3).emit().as_('dest')\\\n",
    "    .path().as_('p')\\\n",
    "    .count(Scope.local).order(asc=True).as_('length')\\\n",
    "    .select('dest').dedup()\\\n",
    "    .select('dest', 'length').to_list().by('city').run()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "mogwai",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
