{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First, we download the webpage of the Practical Gremlin book"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from bs4 import BeautifulSoup\n",
    "import requests\n",
    "import re\n",
    "response = requests.get(\"https://kelvinlawrence.net/book/Gremlin-Graph-Guide.html\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we extract all Gremlin queries on this page"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "pattern = re.compile(r\"g\\.(?:V|E|add).*(?:\\;|$)\")\n",
    "newpattern = re.compile(r\"g\\.(?:V|E|add)(?:[^\\)]+\\)+\\.[a-zA-Z])*[^\\)]+\\)+\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Assuming the response from the GET request is stored in the variable 'response'\n",
    "soup = BeautifulSoup(response.text, 'html.parser')\n",
    "\n",
    "#find all sections\n",
    "sections = soup.find_all('div', {\"class\": \"sect1\"})\n",
    "section_filter = filter(lambda x: x.find('h2').get_text().split(\".\")[0] in [\"3\", \"4\", \"5\"], sections)\n",
    "\n",
    "queries = []\n",
    "\n",
    "for section in section_filter:\n",
    "\t# Find all code blocks in the HTML page\n",
    "\tcode_blocks = section.find_all('code')\n",
    "\n",
    "\t# Extract the text from each code block\n",
    "\tcode_texts = (line for code in code_blocks for line in code.get_text(strip=True).split(\"\\n\") if len(line)>0)\n",
    "\n",
    "\t# Print the extracted code texts\n",
    "\tfor code_text in code_texts:\n",
    "\t\t# Find all occurrences of the pattern in the code text\n",
    "\t\tqueries.extend(newpattern.findall(code_text))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "908"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i, query in enumerate(queries):\n",
    "\tprint(f\"{i+1}: {query}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, we'd like to find all steps used in these queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "steps = {}\n",
    "steps_pattern = re.compile(r\"(\\w+)\\(\")\n",
    "for query in queries:\n",
    "\tfor step in steps_pattern.findall(query):\n",
    "\t\tsteps[step] = steps.get(step, 0) + 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "131\n",
      "{'V': 885, 'hasLabel': 239, 'groupCount': 43, 'by': 577, 'has': 703, 'out': 383, 'path': 135, 'repeat': 68, 'times': 32, 'next': 72, 'getClass': 3, 'values': 244, 'E': 28, 'hasNot': 1, 'not': 21, 'count': 209, 'outE': 88, 'label': 20, 'group': 79, 'select': 161, 'fold': 83, 'in': 22, 'inV': 58, 'limit': 151, 'as': 207, 'from': 28, 'to': 34, 'dedup': 32, 'hasNext': 2, 'project': 30, 'unfold': 66, 'inE': 5, 'outV': 7, 'tail': 7, 'range': 7, 'timeLimit': 2, 'until': 30, 'skip': 2, 'both': 13, 'valueMap': 76, 'with': 9, 'elementMap': 3, 'union': 30, 'id': 19, 'toList': 19, 'join': 3, 'toSet': 1, 'order': 80, 'toBulkSet': 2, 'fill': 4, 'hasId': 32, 'between': 18, 'lt': 18, 'where': 72, 'is': 71, 'eq': 15, 'neq': 32, 'mean': 12, 'local': 27, 'sum': 12, 'max': 8, 'min': 2, 'gte': 8, 'inside': 3, 'outside': 2, 'within': 33, 'without': 14, 'gt': 55, 'lte': 8, 'and': 13, 'coin': 4, 'sample': 12, 'startingWith': 5, 'or': 10, 'endingWith': 1, 'containing': 2, 'notStartingWith': 1, 'notEndingWith': 1, 'notContaining': 6, 'filter': 22, 'choose': 14, 'option': 8, 'constant': 22, 'match': 5, 'identity': 9, 'sideEffect': 2, 'store': 8, 'aggregate': 10, 'inject': 1, 'coalesce': 13, 'optional': 2, 'bothE': 15, 'bothV': 5, 'otherV': 5, 'simplePath': 31, 'loops': 7, 'emit': 12, 'cap': 13, 'cyclicPath': 5, 'addE': 31, 'math': 14, 'signum': 1, 'withIndex': 2, 'indexed': 1, 'index': 7, 'addV': 41, 'property': 79, 'size': 1, 'drop': 14, 'properties': 51, 'value': 10, 'key': 9, 'propertyMap': 1, 'hasValue': 7, 'element': 2, 'graph': 1, 'explain': 2, 'keys': 3, 'sack': 36, 'get': 12, 'startsWith': 1, 'toString': 1, 'contains': 2, 'map': 8, 'flatMap': 3, 'test': 2, 'regex': 1, 'tree': 2, 'subgraph': 7, 'profile': 2, 'sort': 1}\n"
     ]
    }
   ],
   "source": [
    "print(len(steps))\n",
    "print(steps)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "57"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#steps in PyMogwai\n",
    "steps_in_pymogwai = {\"filter\", \"has\", \"hasId\", \"hasName\", \"hasLabel\", \"is\",\n",
    "                     \"contains\", \"within\", \"simplePath\", \"limit\", \"dedup\", \"identity\", \"name\",\n",
    "                     \"value\", \"label\", \"properties\", \"select\", \"order\", \"count\", \"path\",\n",
    "                     \"max\", \"min\", \"sum\", \"mean\", \"out\", \"outE\", \"outV\", \"inE\", \"inV\",\n",
    "                     \"in\", \"both\", \"bothE\", \"bothV\", \"repeat\", \"branch\", \"option\", \"until\",\n",
    "                     \"times\", \"emit\", \"as\", \"by\", \"sideEffect\", \"property\", \"toList\", \"next\",\n",
    "                     \"iter\",\"asPath\", \"V\", \"E\", \"gt\", \"gte\", \"lt\", \"lte\", \"or\", \"not\", \"and\"}\n",
    "len(steps_in_pymogwai)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g.V().hasLabel('airport').groupCount().by('country'): {'groupCount'}\n",
      "g.V().has('airport','code','DFW').next().getClass(): {'getClass'}\n",
      "g.V().has('airport','code','DFW').values(): {'values'}\n",
      "g.V().has('airport','code','DFW').values('city'): {'values'}\n",
      "g.V().has('airport','code','DFW').values('runways','icao'): {'values'}\n",
      "g.V().hasNot('region'): {'hasNot'}\n",
      "g.V().groupCount().by(label): {'groupCount'}\n",
      "g.V().label().groupCount(): {'groupCount'}\n",
      "g.E().groupCount().by(label): {'groupCount'}\n",
      "g.E().label().groupCount(): {'groupCount'}\n",
      "g.V().group().by(label).by(count()): {'group'}\n",
      "g.V().hasLabel('country').group().by('code').by(out().count()): {'group'}\n",
      "g.V().hasLabel('continent').group().by('code').by(out().count()): {'group'}\n",
      "g.V().hasLabel('airport').groupCount().by('country').select('FR'): {'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE'): {'groupCount'}\n",
      "g.V().has('airport','code','AUS').out().values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('airport','code','AUS').out('route').values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('airport','code','AUS').out('route').out('route').values('code'): {'values'}\n",
      "g.V().has('airport','code','LCY').in('route').values('code'): {'values'}\n",
      "g.V().has('code','LHR').out('route').has('country','US').values('code'): {'values'}\n",
      "g.V().has('airport','code','LCY').out().limit(5).values('runways').path().by('code').by('code').by(): {'values'}\n",
      "g.V(3).out().limit(5).path().by(values('code','city').fold()): {'values', 'fold'}\n",
      "g.V().has('airport','code','AUS').out().as('a').out().as('b').path().by('code').from('a').to('b').limit(10): {'from', 'to'}\n",
      "g.V().has('airport','code','AUS').out().as('a').out().path().by('code').from('a').limit(10): {'from'}\n",
      "g.V().has('airport','code','AUS').out().as('a').out().as('b').out().path().by('code').from('a').to('b').limit(10): {'from', 'to'}\n",
      "g.V().has('airport','code','AUS').out().out().as('b').out().path().by('code').to('b').limit(10): {'to'}\n",
      "g.V().has('airport','code','AUS').as('a').out().out().as('b').out().path().by('code').to('b').limit(10).dedup(): {'to'}\n",
      "g.V().has('code','AUS').out('route').has('code','DFW').hasNext(): {'hasNext'}\n",
      "g.V().has('code','AUS').out('route').has('code','SYD').hasNext(): {'hasNext'}\n",
      "g.V().has('type','airport').limit(10).project('a','b','c').by('code').by('region').by(out().count()): {'project'}\n",
      "g.V().has('type','airport').limit(10).project('IATA','Region','Routes').by('code').by('region').by(out().count()): {'project'}\n",
      "g.V().has('code','AUS').as('a').out().as('a').limit(10).select(last,'a').by('code').fold(): {'fold'}\n",
      "g.V().has('code','AUS').as('a').out().as('a').limit(10).select(first,'a').by('code').fold(): {'fold'}\n",
      "g.V().has('code','AUS').as('a').out().as('a').limit(10).select(all,'a').unfold().values('code').fold(): {'unfold', 'values', 'fold'}\n",
      "g.V().has('code','LAX').out().as('stop').out().out().as('stop').out().out().as('stop').limit(1).select(all,'stop').unfold().values('code').fold(): {'unfold', 'values', 'fold'}\n",
      "g.V().has('code','MIA').outE().as('e').inV().has('code','DFW').select('e').values('dist'): {'values'}\n",
      "g.V().has('code','MIA').inE().as('e').outV().has('code','DFW').select('e').values('dist'): {'values'}\n",
      "g.V().hasLabel('airport').values('code').limit(20): {'values'}\n",
      "g.V().hasLabel('airport').values('code').tail(20): {'values', 'tail'}\n",
      "g.V().hasLabel('airport').limit(20).values('code'): {'values'}\n",
      "g.V().hasLabel('airport').range(0,20).values('code'): {'values', 'range'}\n",
      "g.V().has('airport','code','AUS').repeat(timeLimit(10).out()).until(has('code','LHR')).path().by('code'): {'timeLimit'}\n",
      "g.V().has('airport','code','AUS').repeat(timeLimit(20).out()).until(has('code','LHR')).path().by('code'): {'timeLimit'}\n",
      "g.V().hasLabel('airport').range(0,2): {'range'}\n",
      "g.V().hasLabel('airport').range(3,6): {'range'}\n",
      "g.V().range(3500,-1): {'range'}\n",
      "g.V().hasLabel('country').range(0,2): {'range'}\n",
      "g.V().has('region','US-TX').skip(5).fold(): {'skip', 'fold'}\n",
      "g.V().has('region','US-TX').range(5,-1).fold(): {'fold', 'range'}\n",
      "g.V().has('region','US-TX').fold(): {'fold'}\n",
      "g.V().has('region','US-TX').fold().skip(local,3): {'skip', 'fold'}\n",
      "g.V().has('region','GB-ENG').values('runways').fold(): {'values', 'fold'}\n",
      "g.V().has('region','GB-ENG').values('runways').dedup().fold(): {'values', 'fold'}\n",
      "g.V().has('region','GB-ENG').dedup().by('runways').values('code','runways').fold(): {'values', 'fold'}\n",
      "g.V().has('code','AUS').valueMap().unfold(): {'unfold', 'valueMap'}\n",
      "g.V().has('code','AUS').valueMap(true).unfold(): {'unfold', 'valueMap'}\n",
      "g.V().has('code','AUS').valueMap(true,'region'): {'valueMap'}\n",
      "g.V().has('code','AUS').valueMap().select('code','icao','desc'): {'valueMap'}\n",
      "g.V().has('code','AUS').valueMap(true,'code','icao','desc','city').unfold(): {'unfold', 'valueMap'}\n",
      "g.E(5161).valueMap(true): {'valueMap'}\n",
      "g.V().has('code','SFO').valueMap().with(WithOptions.tokens).unfold(): {'unfold', 'with', 'valueMap'}\n",
      "g.V().has('code','SFO').valueMap('code').with(WithOptions.tokens).unfold(): {'unfold', 'with', 'valueMap'}\n",
      "g.V().has('code','SFO').valueMap('code').with(WithOptions.tokens,WithOptions.labels).unfold(): {'unfold', 'with', 'valueMap'}\n",
      "g.V().has('code','SFO').valueMap('code').with(WithOptions.tokens,WithOptions.ids).unfold(): {'unfold', 'with', 'valueMap'}\n",
      "g.V().has('code','SFO').valueMap().by(unfold()).unfold(): {'unfold', 'valueMap'}\n",
      "g.V().has('code','AUS').elementMap().unfold(): {'unfold', 'elementMap'}\n",
      "g.V().has('code','AUS').elementMap('city'): {'elementMap'}\n",
      "g.V(3).outE().limit(1).elementMap(): {'elementMap'}\n",
      "g.E(5161).project('v','IN','OUT').by(valueMap(true)).by(inV().union(id(): {'project', 'id', 'valueMap', 'union'}\n",
      "g.E(5161).project('v','IN','OUT').by(valueMap(true)).by(project('id','label').by(inV().id()).by(inV().label())).by(project('id','label').by(outV().id()).by(outV().label())).unfold(): {'project', 'unfold', 'id', 'valueMap'}\n",
      "g.V().has('code','AUS').valueMap().next(): {'valueMap'}\n",
      "g.V().has('airport','region','US-TX').values('runways').toList().join(','): {'join', 'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').toSet().join(','): {'toSet', 'join', 'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').dedup().order().fold(): {'values', 'fold'}\n",
      "g.V().has('airport','region','US-TX').values('runways').toList(): {'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').toBulkSet().join(','): {'toBulkSet', 'join', 'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').toBulkSet(): {'toBulkSet', 'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').fill(a): {'fill', 'values'}\n",
      "g.V().has('airport','region','US-TX').values('runways').fill(s): {'fill', 'values'}\n",
      "g.V().has('code','DFW').id(): {'id'}\n",
      "g.V().hasId(8).values('code'): {'values'}\n",
      "g.V().has(id,8).values('code'): {'values'}\n",
      "g.V().hasId(between(1,6)): {'between'}\n",
      "g.V().has(id,between(1,6)): {'between'}\n",
      "g.V(3).values('code'): {'values'}\n",
      "g.V(3,6,8,15).values('code'): {'values'}\n",
      "g.V(a).values('code'): {'values'}\n",
      "g.V().hasLabel('country').has('code','AU').out('contains').values('code'): {'values'}\n",
      "g.V().has('country','code','AU').out().values('code'): {'values'}\n",
      "g.V().where(label().is(eq('airport'))).count(): {'eq', 'where'}\n",
      "g.V().has(label,neq('airport')).count(): {'neq'}\n",
      "g.V().where(label().is(neq('airport'))).count(): {'neq', 'where'}\n",
      "g.E().where(label().is(eq('route'))).count(): {'eq', 'where'}\n",
      "g.V().hasLabel('airport').local(out('route').count()).mean(): {'local'}\n",
      "g.V().hasLabel('airport').local(out('route').count()).limit(10): {'local'}\n",
      "g.V().has('region','GB-SCT').order().by('code').values('code','city').fold(): {'values', 'fold'}\n",
      "g.V().has('region','GB-SCT').order().by('code').local(values('code','city').fold()): {'values', 'fold', 'local'}\n",
      "g.V().hasLabel('airport').values('runways').sum(): {'values'}\n",
      "g.V().hasLabel('airport').values('runways').mean(): {'values'}\n",
      "g.V().hasLabel('airport').values('longest').mean(): {'values'}\n",
      "g.V().hasLabel('airport').local(both('route').count()).mean(): {'local'}\n",
      "g.V().hasLabel('airport').values('longest').max(): {'values'}\n",
      "g.V().hasLabel('airport').local(out('route').count()).max(): {'local'}\n",
      "g.V().hasLabel('airport').values('longest').min(): {'values'}\n",
      "g.V().hasLabel('continent').values('desc').min(): {'values'}\n",
      "g.V().hasLabel('continent').values('desc').max(): {'values'}\n",
      "g.V().hasLabel('continent').values('desc').order().limit(1): {'values'}\n",
      "g.V().hasLabel('continent').values('desc').order().by(desc).limit(1): {'values'}\n",
      "g.V().has('runways',gte(5)).values('code','runways').fold(): {'values', 'fold'}\n",
      "g.V().has('runways',lt(3)).values('code','runways').fold(): {'values', 'fold'}\n",
      "g.V().has('runways',eq(3)).count(): {'eq'}\n",
      "g.V().has('runways',neq(1)).count(): {'neq'}\n",
      "g.V().values('runways').is(3).count(): {'values'}\n",
      "g.V().has('runways',inside(3,6)).values('code','runways'): {'values', 'inside'}\n",
      "g.V().has('runways',outside(3,6)).values('code','runways'): {'values', 'outside'}\n",
      "g.V().has('runways',within(3..6)).values('code','runways').limit(15): {'values'}\n",
      "g.V().has('runways',within(1,2,3)).values('code','runways').limit(15): {'values'}\n",
      "g.V().has('runways',without(3..6)).values('code','runways').limit(15): {'values', 'without'}\n",
      "g.V().has('runways',between(5,8)).values('code','runways').fold(): {'between', 'values', 'fold'}\n",
      "g.V().hasId(between(1,47)).out().hasId(lte(46)).count(): {'between'}\n",
      "g.V().hasId(within(1..46)).out().hasId(between(1,47)).count(): {'between'}\n",
      "g.V().hasId(inside(0,47)).out().hasId(lte(46)).count(): {'inside'}\n",
      "g.V().has('airport','region','US-TX').has('city',neq('Houston')).values('code'): {'neq', 'values'}\n",
      "g.V().has('airport','code','AUS').out().has('code',without('PHX','LAX')).out().has('code','LAS').path().by('code'): {'without'}\n",
      "g.V().has('airport','code','AUS').out().has('country',within('US','CA')).has('code',without('PHX','LAX')).out().has('code','LAS').path().by('code'): {'without'}\n",
      "g.V().hasLabel('airport').has('city',between('Dal','Dam')).values('city'): {'between', 'values'}\n",
      "g.V().hasLabel('airport').has('city',between('Dal','Dam')).values('city').dedup(): {'between', 'values'}\n",
      "g.V().hasLabel('airport').has('city',between('Dal','Dat')).values('city').order().dedup(): {'between', 'values'}\n",
      "g.V().has('airport','code',between('X','Xa')).values('code').fold(): {'between', 'values', 'fold'}\n",
      "g.V().has('airport','code','AUS').out().has('code',neq('DFW')).out().has('code','SYD').path().by('code'): {'neq'}\n",
      "g.V().has('airport','code','AUS').out().not(values('code').is('DFW')).out().has('code','SYD').path().by('code'): {'values'}\n",
      "g.V().has('airport','code','AUS').out().and(has('code',neq('DFW')): {'neq'}\n",
      "g.V().has('airport','code','AUS').out().has('code',without('DFW','LAX')).out().has('code','SYD').path().by('code'): {'without'}\n",
      "g.V().has('airport','code','SAT').out().has('code',without('DFW','LAX','PHX','JFK')).out().has('code','SLC').path().by('code'): {'without'}\n",
      "g.V().has('code','AUS').out().has('country',without('US','CA')).values('city'): {'values', 'without'}\n",
      "g.V().has('code','AUS').out().has('country',within('MX','CA')).values('city'): {'values'}\n",
      "g.V().hasLabel('airport').coin(0.5).limit(20).values('code'): {'coin', 'values'}\n",
      "g.V().hasLabel('airport').coin(0.05).values('code','elev').fold(): {'coin', 'values', 'fold'}\n",
      "g.V().hasLabel('airport').coin(0.5).count(): {'coin'}\n",
      "g.V().hasLabel('airport').sample(20).values('code'): {'values', 'sample'}\n",
      "g.V().hasLabel('airport').sample(1).id(): {'id', 'sample'}\n",
      "g.V().hasLabel('airport').coin(0.01).limit(1): {'coin'}\n",
      "g.V().hasLabel('airport').sample(1).id().next(): {'id', 'sample'}\n",
      "g.V(x).values('code'): {'values'}\n",
      "g.V().hasLabel('airport').id().toList(): {'id'}\n",
      "g.V(airports[x-1]).values('code'): {'values'}\n",
      "g.V().hasLabel('airport').has('city',startingWith('X')).values('city'): {'startingWith', 'values'}\n",
      "g.V().hasLabel('airport').has('city',startingWith('Dal')).values('city').dedup().fold(): {'startingWith', 'values', 'fold'}\n",
      "g.V().hasLabel('airport').has('city',startingWith('dal')).count(): {'startingWith'}\n",
      "g.V().hasLabel('airport').or(has('city',startingWith('dal')): {'startingWith'}\n",
      "g.V().hasLabel('airport').has('city',endingWith('zhi')).values('city'): {'values', 'endingWith'}\n",
      "g.V().hasLabel('airport').has('city',containing('gzh')).values('city'): {'containing', 'values'}\n",
      "g.V().hasLabel('airport').has('city',notStartingWith('Dal')).count(): {'notStartingWith'}\n",
      "g.V().hasLabel('airport').not(has('city',startingWith('Dal'))).count(): {'startingWith'}\n",
      "g.V().hasLabel('airport').has('city',notEndingWith('zhi')).count(): {'notEndingWith'}\n",
      "g.V().hasLabel('airport').has('city',notContaining('berg')).count(): {'notContaining'}\n",
      "g.V().hasLabel('airport').has('city',notContaining('e')).has('city',notContaining('a')).has('city',notContaining('i')).has('city',notContaining('u')).has('city',notContaining('o')).or(has('city',containing('y')): {'containing', 'notContaining'}\n",
      "g.V().hasLabel('airport').limit(20).values('code').order().fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').order().by('code').limit(20).values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('code','AUS').out().order().by('code').values('code','icao').fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').limit(20).values('code').order().by(desc).fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').limit(20).values('code').order().by(shuffle).fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').order().by('longest',desc).valueMap().select('code','longest').limit(10): {'valueMap'}\n",
      "g.V().hasLabel('airport').order().by(values('longest'): {'values'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('runways'): {'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('runways').order(local).by(keys,asc): {'group'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('runways').by('code').order(local).by(keys,desc): {'group'}\n",
      "g.V().hasLabel('airport').has('region',within('US-TX','US-LA','US-AZ','US-OK')).order().by('region',asc).valueMap().select('code','region'): {'valueMap'}\n",
      "g.V().hasLabel('airport').where(out().count().is(lt(100).and(gt(94)))).group().by('code').by(out().count()): {'where', 'group'}\n",
      "g.V().hasLabel('airport').where(and(out().count().is(lt(100)): {'where'}\n",
      "g.V().hasLabel('airport').where(out().count().is(between(95,101))).group().by('code').by(out().count()): {'between', 'where', 'group'}\n",
      "g.V().hasLabel('airport').where(out().count().is(inside(94,100))).group().by('code').by(out().count()): {'where', 'group', 'inside'}\n",
      "g.V().hasLabel('airport').where(out().count().is(lt(100).and(gt(94)))).group().by(out().count()).by('code'): {'where', 'group'}\n",
      "g.V().hasLabel('airport').where(out().count().is(lt(100).and(gt(94)).and(neq(97)))).group().by(out().count()).by('code'): {'neq', 'where', 'group'}\n",
      "g.V().where(values('runways').is(gt(5))): {'where', 'values'}\n",
      "g.V().hasLabel('airport').where(out('route').count().is(gt(60))).count(): {'where'}\n",
      "g.V().hasId(lt(47)).outE().and(where(inV().id().is(lt(47))): {'id', 'where'}\n",
      "g.V().has('airport','code','AUS').out().not(where(__.in('contains').has('code','US'))).valueMap('code','city'): {'valueMap', 'where'}\n",
      "g.V().has('airport','code','AUS').out().has('country',neq('US')).valueMap('code','city'): {'neq', 'valueMap'}\n",
      "g.V().has('airport','code','AUS').out().not(has('country','US')).valueMap('code','city'): {'valueMap'}\n",
      "g.V().has('airport','code','AUS').out().where(values('runways').is(gt(4).and(neq(6)))).valueMap('code','runways'): {'valueMap', 'neq', 'where', 'values'}\n",
      "g.V().has('airport','code','AUS').out().where(values('runways').is(gt(6).or(eq(4)))).valueMap('code','runways'): {'valueMap', 'eq', 'where', 'values'}\n",
      "g.V().has('airport','code','AUS').out().where(values('runways').is(gt(6)).or().values('runways').is(4)).valueMap('code','runways'): {'valueMap', 'where', 'values'}\n",
      "g.V().has('airport','code','AUS').as('a').out().out().where(neq('a')).path().by('code').limit(10): {'neq', 'where'}\n",
      "g.V().has('code','AUS').as('a').out().where(eq('a')).by('runways').valueMap('code','runways'): {'valueMap', 'eq', 'where'}\n",
      "g.V().has('code','AUS').as('a').out().as('b').filter(select('a','b').by('runways').where('a',eq('b'))).valueMap('code','runways'): {'valueMap', 'eq', 'where'}\n",
      "g.V().has('airport','code','AUS').as('a').out().as('b').where('a',gt('b')).by('runways').valueMap('code','runways'): {'valueMap', 'where'}\n",
      "g.V().has('airport','city','London').as('a','r').in('contains').as('b').where('a',eq('b')).by('country').by('code').select('a','r','b').by('code').by('region'): {'eq', 'where'}\n",
      "g.V().has('airport','city','London').valueMap('code','region','country'): {'valueMap'}\n",
      "g.V().has('code','NCE').values('region').as('r').V().hasLabel('airport').as('a').values('region').where(eq('r')).by().local(select('a').values('city','code','region').fold()): {'where', 'values', 'fold', 'local', 'eq'}\n",
      "g.V().has('region','US-TX').choose(values('longest').is(gt(12000)): {'choose', 'values'}\n",
      "g.V().hasLabel('airport').choose(values('code').is(within('AUS','DFW')): {'choose', 'values'}\n",
      "g.V().hasLabel('airport').limit(10).choose(values('runways').is(lt(4)): {'choose', 'values'}\n",
      "g.V().hasLabel('airport').sample(10).as('a').choose(out('route').count().is(gt(50)): {'choose', 'sample'}\n",
      "g.V().hasLabel('airport').choose(values('code')).option('DFW',values('desc')).option('AUS',values('region')).option('LAX',values('runways')): {'choose', 'values'}\n",
      "g.V().hasLabel('airport').limit(10).choose(values('runways')).option(1,constant('just one')).option(2,constant('a couple')).option(7,constant('lots')).option(none,constant('quite a few')): {'choose', 'values', 'constant'}\n",
      "g.V().hasLabel('airport').groupCount().by(choose(values('elev')).option(gt(5000): {'values', 'choose', 'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by(choose(values('elev').is(gt(5000)): {'values', 'choose', 'groupCount'}\n",
      "g.V().has('code','JFK').match(__.as('s').out().as('d'): {'match'}\n",
      "g.V().hasLabel('airport').match(__.as('s').out().as('d'): {'match'}\n",
      "g.V().hasLabel('airport').match(__.as('a').out().as('b'): {'match'}\n",
      "g.V().has('code','AUS').match(__.as('aus').values('runways').as('ausr'): {'match', 'values'}\n",
      "g.V().has('code','AUS').as('aus').values('runways').as('ausr').select('aus').out().as('outa').values('runways').as('outr').where('ausr',eq('outr')).select('outa').valueMap().select('code','runways'): {'valueMap', 'eq', 'where', 'values'}\n",
      "g.V().has('code','JFK').as('s').out().as('d').where(__.not(out().as('s'))).select('s','d').by('code'): {'where'}\n",
      "g.V().has('code','JFK').as('s').out().as('d').where(__.not(out().as('s'))).select('s','d').by('code').select(values): {'where'}\n",
      "g.V().hasLabel('airport').as('s').out().as('d').where(__.not(out().as('s'))).limit(10).select('s','d').by('code').order().by(select('s')): {'where'}\n",
      "g.V().has('airport','code','DFW').as('a').union(select('a'): {'union'}\n",
      "g.V().union(has('airport','code','DFW'): {'union'}\n",
      "g.V().has('airport','code','DFW').group().by().by(out().count()): {'group'}\n",
      "g.V().has('airport','code','DFW').union(identity(): {'union'}\n",
      "g.V().has('airport','code','DFW').union(identity().values('code'): {'values', 'union'}\n",
      "g.V(3).union(constant(\"Hello\"): {'constant', 'union'}\n",
      "g.V().hasLabel(\"airport\").sample(10).local(union(id(): {'id', 'sample', 'local', 'union'}\n",
      "g.V().hasLabel(\"airport\").sample(10).union(id(): {'id', 'sample', 'union'}\n",
      "g.V().has('code','AUS').union(__.in().has('country','UK'): {'union'}\n",
      "g.V().has('city','London').has('region','GB-ENG').union(out('route').has('city','Paris'): {'union'}\n",
      "g.V().has('city','London').has('region','GB-ENG').local(union(__.values('code'): {'values', 'local', 'union'}\n",
      "g.V().has('city','London').has('region','GB-ENG').union(outE().inV().has('city','Berlin').outE('route').inV().has('city','Lisbon').path().by('code').by('dist').by('code').by('dist'): {'union'}\n",
      "g.V().has('city','Madrid').outE('route').union(values('dist').sum(): {'values', 'union'}\n",
      "g.V().has('airport','code','AUS').union(out().has('code','LHR'): {'union'}\n",
      "g.V().has('airport','code','AUS').out().has('code',within('LHR','DFW','SYD')).values('code'): {'values'}\n",
      "g.V(3).sideEffect(out().count().store('a')).out().out().count().as('b').select('a','b'): {'store'}\n",
      "g.V().has('code','SFO').sideEffect{println\"I'm working on it\"}.values('desc'): {'values'}\n",
      "g.V().has('code','AUS').out().aggregate('nonstop').out().where(without('nonstop')).dedup().count(): {'aggregate', 'where', 'without'}\n",
      "g.V().has('code','AUS').values().inject('ABIA'): {'values', 'inject'}\n",
      "g.V().choose(V().hasLabel('XYZ').count().is(0): {'choose'}\n",
      "g.V(3).coalesce(out('fly'): {'coalesce'}\n",
      "g.V(1).coalesce(has('region','US-TX').values('desc'): {'coalesce', 'values'}\n",
      "g.V(3).coalesce(has('region','US-TX').values('desc'): {'coalesce', 'values'}\n",
      "g.V().has('code','AUS').optional(out().has('code','SYD')).values('city'): {'optional', 'values'}\n",
      "g.V().has('code','AUS').optional(out().has('code','DFW')).values('city'): {'optional', 'values'}\n",
      "g.V().has('code','AUS').coalesce(out().has('code','SYD'): {'coalesce'}\n",
      "g.V().has('code','AUS').coalesce(out().has('code','DFW'): {'coalesce'}\n",
      "g.V(3).both().order().by(id).fold(): {'fold'}\n",
      "g.V(3).both().dedup().order().by(id).fold(): {'fold'}\n",
      "g.V(3).bothE().bothV().dedup().order().by(id()).fold(): {'id', 'fold'}\n",
      "g.V(3).bothE().otherV().dedup().count(): {'otherV'}\n",
      "g.V(3).bothE().otherV().dedup().order().by(id()).fold(): {'otherV', 'id', 'fold'}\n",
      "g.V(3).repeat(out()).until(loops().is(2)).count(): {'loops'}\n",
      "g.V(3).repeat(out().simplePath()).until(has('code','MIA').or().loops().is(3)).has('code','MIA').path().by('code').limit(5): {'loops'}\n",
      "g.V().has('airport','code','AUS').emit().repeat(out().simplePath()).times(2).limit(10).values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('code','SAF').repeat('r1',out().simplePath()).until(loops('r1').is(3).or().has('code','MAN')).path().by('city').limit(3).toList(): {'loops'}\n",
      "g.V().has('code','SFO').repeat(out().simplePath().groupCount('airports').by(loops())).times(3).cap('airports'): {'cap', 'loops', 'groupCount'}\n",
      "g.V().has('code','SFO').repeat(out().simplePath().groupCount('airports').by(loops()).where(select('airports').select(loops()).is(lte(5)))).emit().times(3).path().by('code'): {'loops', 'groupCount', 'where'}\n",
      "g.V(1,2,3,4,5).groupCount('x').by(constant('A')).select('x'): {'groupCount', 'constant'}\n",
      "g.V(1,2,3,4,5).groupCount('x').by(constant('A')).where(select('x').select('A').is(3)): {'where', 'groupCount', 'constant'}\n",
      "g.V(1,2,3,4,5).groupCount('x').by(constant('A')).where(select('x').select('A').is(lte(3))): {'where', 'groupCount', 'constant'}\n",
      "g.V().has('code','AUS').out().out().cyclicPath().limit(10).path().by('code'): {'cyclicPath'}\n",
      "g.V().has('code','AUS').repeat(out('route')).until(cyclicPath()).limit(10).path().by('code'): {'cyclicPath'}\n",
      "g.V().has('code','AUS').out().out().not(cyclicPath()).limit(10).path().by('code'): {'cyclicPath'}\n",
      "g.V().has('code','AUS').as('a').out().out().where(neq('a')).limit(10).path().by('code'): {'neq', 'where'}\n",
      "g.V(3).as('a').addE('loop').to('a'): {'to', 'addE'}\n",
      "g.V().out().cyclicPath().path(): {'cyclicPath'}\n",
      "g.V().outE().inV().cyclicPath().path(): {'cyclicPath'}\n",
      "g.V().hasLabel('airport').group().by('code').by(out('route').count()): {'group'}\n",
      "g.V().hasLabel('airport').group().by('code').by(out('route').count()).select('LHR','JFK','DFW'): {'group'}\n",
      "g.V().hasLabel('airport').group().by('code').by(__.in('route').count()).select('LHR','JFK','DFW'): {'group'}\n",
      "g.V().hasLabel('airport').group().by('code').by(out().count()).order(local).by(values).unfold().tail(10).fold(): {'unfold', 'group', 'fold', 'tail'}\n",
      "g.V().hasLabel('airport').limit(10).project(\"v\",\"degree\").by('code').by(bothE('route').count()): {'project'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(bothE('route').count()): {'group'}\n",
      "g.V().limit(1).math('100/2'): {'math'}\n",
      "g.V().has('airport','code','DFW').values('runways'): {'values'}\n",
      "g.V().has('airport','code','SFO').values('runways'): {'values'}\n",
      "g.V().has('airport','code','DFW').as('a').out().has('code','SFO').as('b').math('a + b').by('runways'): {'math'}\n",
      "g.V(3).out().count().math('_ / 2'): {'math'}\n",
      "g.V(3).out().count().math('_ % 5'): {'math'}\n",
      "g.V(3).out().count().as('a').math('a / 2'): {'math'}\n",
      "g.V().has('code','SAF').as('a').out().as('b').select('a','b').by(values('code','runways').fold()): {'values', 'fold'}\n",
      "g.V().has('code','SAF').as('a').out().as('b').math('a + b').by('runways'): {'math'}\n",
      "g.V().has('code','DFW').values('longest').math('_ * 0.3048'): {'math', 'values'}\n",
      "g.V().has('code','DFW').project('Longest runway at','feet','meters').by('code').by('longest').by(values('longest').math('_ * 0.3048')): {'project', 'values', 'math'}\n",
      "g.V().hasLabel('airport').sample(12).project('IATA','city','position').by('code').by('city').by(choose(values('lon').math('signum(_): {'signum', 'values', 'sample', 'project', 'choose', 'math'}\n",
      "g.V().hasLabel('airport').values('runways').mean().next(): {'values'}\n",
      "g.V().hasLabel('airport').groupCount().by('runways'): {'groupCount'}\n",
      "g.V().hasLabel('airport').local(out().count()).mean().next(): {'local'}\n",
      "g.V().hasLabel('airport').values('runways').fold().as('runways').mean(local).as('mean').select('runways').unfold().math('(_-mean): {'math', 'unfold', 'values', 'fold'}\n",
      "g.V().has('code','AUS').project('in','out').by(__.in('route').count()).by(out('route').count()): {'project'}\n",
      "g.V().has('code','AUS').project('in','out').by(__.in('route').count()).by(out('route').count()).math('in + out'): {'project', 'math'}\n",
      "g.V().has('region','US-OK').values('code').withIndex(): {'values', 'withIndex'}\n",
      "g.V().has('region','US-OK').values('code').withIndex(1): {'values', 'withIndex'}\n",
      "g.V().has('region','US-OK').values('code').indexed(1): {'values', 'indexed'}\n",
      "g.V().has('code','LHR').out().limit(5).values('code').index(): {'index', 'values'}\n",
      "g.V().has('code','LHR').out().limit(5).values('code').fold().index(): {'index', 'values', 'fold'}\n",
      "g.V().has('code','LHR').out().limit(5).values('code').fold().index().unfold(): {'index', 'unfold', 'values', 'fold'}\n",
      "g.V().has('code','LHR').out().limit(5).values('code').fold().index().with(WithOptions.indexer,WithOptions.map): {'index', 'with', 'values', 'fold'}\n",
      "g.V().has('code','LHR').out().limit(5).values('code').fold().index().with(WithOptions.indexer,WithOptions.list).unfold().order().by(tail(local,1): {'index', 'unfold', 'values', 'tail', 'fold', 'with'}\n",
      "g.V().has('code','SAF').out().values('code').fold().index(): {'index', 'values', 'fold'}\n",
      "g.V().has('code','SAF').out().values('code').fold().index().unfold().order().by(tail(local,1): {'index', 'unfold', 'values', 'tail', 'fold'}\n",
      "g.V().has('continent','code','EU').out('contains').values('code').order().fold(): {'values', 'fold'}\n",
      "g.V().where(values('runways').is(gte(6))).values('code'): {'where', 'values'}\n",
      "g.V().has('runways',gte(6)).values('code'): {'values'}\n",
      "g.V().has('code','DFW').outE().as('a').inV().has('code','AUS').select('a').values('dist'): {'values'}\n",
      "g.V().has('code','BNE').out().as('stop').out().has('code','AUS').select('stop').values('code'): {'values'}\n",
      "g.V().hasLabel('airport').where(out('route').count().is(lt(5))).count(): {'where'}\n",
      "g.V().hasLabel(\"airport\").where(outE('route').count().is(gt(200))).values('code'): {'values', 'where'}\n",
      "g.V().hasLabel(\"airport\").filter(outE(\"route\").count().is(gt(200))).values('code'): {'values'}\n",
      "g.V().as('a').outE().has('dist',eq(100)).limit(10).inV().as('b').select('a','b').by('code'): {'eq'}\n",
      "g.V().outE().has('dist',eq(100)).limit(10).inV().path().by('code').by('dist'): {'eq'}\n",
      "g.V().has('airport','elev',gt(10000)).order().by('elev',asc).valueMap('city','elev'): {'valueMap'}\n",
      "g.V().has('airport','elev',gt(10000)).order().by('elev',asc).project('city','elevation').by('city').by('elev'): {'project'}\n",
      "g.V().hasLabel('airport').where(__.in('contains').has('code','AF')).as('a').out().has('country','US').as('b').select('a','b').by('code'): {'where'}\n",
      "g.V().has('code','AUS').out().project('ap','rw').by('code').by('runways').order().by(select('rw'): {'project'}\n",
      "g.V().has('code','AUS').union(in(): {'union'}\n",
      "g.V().has('code','AUS').union(__.in(): {'union'}\n",
      "g.V().has('country','code','PT').out(\"contains\").values('city'): {'values'}\n",
      "g.V().has('airport','country','PT').values('city'): {'values'}\n",
      "g.V().has('code',from).outE().as('a').inV().has('code',to).select('a').values('dist').next(): {'values'}\n",
      "g.V().has(id,a).values('code').next(): {'values'}\n",
      "g.V().group().by(label).by('code').next(): {'group'}\n",
      "g.V().group().by('code').next(): {'group'}\n",
      "g.V().has('airport','country','DE').fill(german): {'fill'}\n",
      "g.V(german[1]).values('city'): {'values'}\n",
      "g.V(a).out().has('country','DE').values('code'): {'values'}\n",
      "g.V(it).out().values('code').toList(): {'values'}\n",
      "g.V().hasLabel('airport').values('code').toList(): {'values'}\n",
      "g.addV('airport').property('code','XYZ').property('icao','KXYZ').property('desc','This is not a real airport').next(): {'addV'}\n",
      "g.V().has('code','DFW').addE('route').to(xyz): {'to', 'addE'}\n",
      "g.V().has('code','DFW').addE('route').to(V().has('code','XYZ')): {'to', 'addE'}\n",
      "g.V().has('code','DFW').addE('route').from(xyz): {'from', 'addE'}\n",
      "g.V().has('code','XYZ').as('a').V().has('code','DFW').addE('route').to('a'): {'to', 'addE'}\n",
      "g.addV(V().has('code','AUS').label()).property('code','XYZ'): {'addV'}\n",
      "g.V(53768).valueMap(true): {'valueMap'}\n",
      "g.V(53768).addE(V().has('code','AUS').outE().limit(1).label()).to(V().has('code','AUS')): {'to', 'addE'}\n",
      "g.E(53770).valueMap(true): {'valueMap'}\n",
      "g.V().has('code','AUS').property('places',out().values('code').fold()): {'values', 'fold'}\n",
      "g.V().has('code','AUS').valueMap('places'): {'valueMap'}\n",
      "g.V().has('code','AUS').values('places').next().size(): {'size', 'values'}\n",
      "g.V().has('code','AUS').values('places').next(): {'values'}\n",
      "g.addV().property(id,99999L): {'addV'}\n",
      "g.addV().property(id,n): {'addV'}\n",
      "g.addV('airport').property('code','AUS').as('aus').addV('airport').property('code','DFW').as('dfw').addV('airport').property('code','LAX').as('lax').addV('airport').property('code','JFK').as('jfk').addV('airport').property('code','ATL').as('atl').addE('route').from('aus').to('dfw').addE('route').from('aus').to('atl').addE('route').from('atl').to('dfw').addE('route').from('atl').to('jfk').addE('route').from('dfw').to('jfk').addE('route').from('dfw').to('lax').addE('route').from('lax').to('jfk').addE('route').from('lax').to('aus').addE('route').from('lax').to('dfw'): {'addV', 'addE', 'from', 'to'}\n",
      "g.addV(\"airport\").property(\"code\",a[0],\"iata\",a[1]).next(): {'addV'}\n",
      "g.addV(\"airport\").property(\"code\",it[0],\"iata\",it[1]).next(): {'addV'}\n",
      "g.V().has('code','XYZ').fold(): {'fold'}\n",
      "g.V().has('code','XYZ').fold().coalesce(unfold(): {'unfold', 'coalesce', 'fold'}\n",
      "g.V(3).fold().coalesce(unfold().property('runways',3): {'unfold', 'coalesce', 'fold'}\n",
      "g.V(3).valueMap().unfold(): {'unfold', 'valueMap'}\n",
      "g.V(9999999).fold().coalesce(unfold().property('runways','3'): {'unfold', 'coalesce', 'fold'}\n",
      "g.V(57343).valueMap().unfold(): {'unfold', 'valueMap'}\n",
      "g.V().has('code','XYZ').drop(): {'drop'}\n",
      "g.V().has('code','AUS').outE().as('e').inV().has('code','LHR').select('e').drop(): {'drop'}\n",
      "g.V().has('code','LHR').outE().as('e').inV().has('code','AUS').select('e').drop(): {'drop'}\n",
      "g.V().has('code','SFO').valueMap(): {'valueMap'}\n",
      "g.V().has('code','SFO').properties('desc').drop(): {'drop'}\n",
      "g.V().has('code','SFO').properties().drop(): {'drop'}\n",
      "g.E().drop(): {'drop'}\n",
      "g.V().drop(): {'drop'}\n",
      "g.V().has('airport','code','DFW').properties().key(): {'key'}\n",
      "g.V().has('code','DFW').outE().properties().key().dedup(): {'key'}\n",
      "g.V().hasLabel(\"airport\").properties(\"runways\",\"longest\").group().by(key).by(value().sum()): {'group'}\n",
      "g.V().has('code','AUS').propertyMap(): {'propertyMap'}\n",
      "g.V().properties().hasValue('London'): {'hasValue'}\n",
      "g.V().properties().hasValue('London').id(): {'id', 'hasValue'}\n",
      "g.V().properties().hasId(583).key(): {'key'}\n",
      "g.V().properties().hasId(583).next().element(): {'element'}\n",
      "g.V().properties().hasId(583).next().element().values('desc'): {'element', 'values'}\n",
      "g.V().has('airport','code','DFW').properties('city').next().graph(): {'graph'}\n",
      "g.V(4).properties('city').id(): {'id'}\n",
      "g.addV().property('code','AUS').property('code','KAUS'): {'addV'}\n",
      "g.V().has('code','AUS').valueMap(): {'valueMap'}\n",
      "g.V().has('code','KAUS').valueMap(): {'valueMap'}\n",
      "g.V().has('code','AUS').values(): {'values'}\n",
      "g.V().properties().hasValue('AUS'): {'hasValue'}\n",
      "g.addV().property('one','hi').property('one','hello').property('two','goodbye').property('one','hello again').valueMap(): {'addV', 'valueMap'}\n",
      "g.addV().next(): {'addV'}\n",
      "g.V(v).property('one','hi').property('one','hello').property('two','goodbye').property('one','hello again').valueMap(): {'valueMap'}\n",
      "g.addV().property('one','hi').property('one','hello').property('two','goodbye').property('one','hello again').explain(): {'addV', 'explain'}\n",
      "g.V(v).property('one','hi').property('one','hello').property('two','goodbye').property('one','hello again').explain(): {'explain'}\n",
      "g.V().has('code','AUS').properties().hasValue('ABIA').drop(): {'hasValue', 'drop'}\n",
      "g.V().has('code','AUS').properties('code').drop(): {'drop'}\n",
      "g.addV('test').property('dups','one').property('dups','two').property('dups','one'): {'addV'}\n",
      "g.V().hasLabel('test').valueMap(): {'valueMap'}\n",
      "g.V(3).valueMap('hw'): {'valueMap'}\n",
      "g.V().has('code','AUS').valueMap('x'): {'valueMap'}\n",
      "g.V().has('code','AUS').properties().hasValue('AUS').property('date','6/6/2017'): {'hasValue'}\n",
      "g.V().has('code','AUS').properties().hasValue('AUS').properties('date'): {'hasValue'}\n",
      "g.V().has('code','AUS').properties().hasValue('AUS').property('date','6/6/2017').drop(): {'hasValue', 'drop'}\n",
      "g.V().has('code','AUS').properties('code').properties('date').drop(): {'drop'}\n",
      "g.V().has('code','AUS').properties().valueMap(): {'valueMap'}\n",
      "g.V().has('code','AUS').properties().valueMap().with(WithOptions.tokens,WithOptions.values): {'with', 'valueMap'}\n",
      "g.V().has('code','AUS').properties().valueMap().with(WithOptions.tokens,WithOptions.keys): {'with', 'valueMap'}\n",
      "g.V().has('code','AUS').properties().valueMap().with(WithOptions.tokens,WithOptions.all): {'with', 'valueMap'}\n",
      "g.V().hasLabel('airport').limit(1).next().keys(): {'keys'}\n",
      "g.E().hasLabel('route').limit(1).next().keys(): {'keys'}\n",
      "g.V().hasLabel('airport').limit(1).values(it).next().class): {'values'}\n",
      "g.V(1..5).group().by('code').by('runways'): {'group'}\n",
      "g.V().hasLabel('airport').limit(40).groupCount().by('region'): {'groupCount'}\n",
      "g.V().hasLabel('airport').limit(20).values('runways').fold().order(local): {'values', 'fold'}\n",
      "g.V().has('airport','country','IE').project('loc','iata').by('city').by('code'): {'project'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()): {'project'}\n",
      "g.V().has('region','US-TX').store('r').by('runways').cap('r'): {'cap', 'store'}\n",
      "g.V().has('airport','country','IE').aggregate('ireland').cap('ireland'): {'cap', 'aggregate'}\n",
      "g.V().has('airport','country','IE').aggregate('ireland').out().where(without('ireland')).values('country').dedup().fold().order(local): {'without', 'values', 'where', 'fold', 'aggregate'}\n",
      "g.V().has('airport','country','IE').store('a').limit(2).cap('a'): {'cap', 'store'}\n",
      "g.V().has('airport','country','IE').aggregate('a').limit(2).cap('a'): {'cap', 'aggregate'}\n",
      "g.V().has('airport','country','IE').aggregate('ireland').by('runways').cap('ireland'): {'cap', 'aggregate'}\n",
      "g.V(1..5).group().by('code').by('runways').next().getClass(): {'getClass', 'group'}\n",
      "g.V(1..5).aggregate('a').cap('a').next().getClass(): {'cap', 'getClass', 'aggregate'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city'): {'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').count(local): {'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(keys): {'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values): {'group'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()).select(values): {'project'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()).select(keys): {'project'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()).select('route_count'): {'project'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()).select('dfw'): {'project'}\n",
      "g.V().has('code','DFW').project('dfw','route_count').by().by(outE().count()).select('dfw').values('desc'): {'project', 'values'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').unfold(): {'unfold', 'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values).unfold(): {'unfold', 'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values).unfold().unfold(): {'unfold', 'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values).repeat(unfold()).times(2): {'unfold', 'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values).repeat(unfold()).until(count(local).is(1)).unfold(): {'unfold', 'group'}\n",
      "g.V().hasLabel('airport').limit(5).group().by('code').by('city').select(values).unfold().unfold().fold(): {'unfold', 'group', 'fold'}\n",
      "g.V(3).valueMap().select(keys): {'valueMap'}\n",
      "g.V(3).valueMap().select(values): {'valueMap'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways'): {'group'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys): {'group'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys).order(local): {'group'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys).unfold().order().fold(): {'unfold', 'group', 'fold'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys).limit(local,2): {'group'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys).tail(local,3): {'group', 'tail'}\n",
      "g.V().has('airport','country','IE').group().by('code').by('runways').select(keys).range(local,3,5): {'group', 'range'}\n",
      "g.V().has('region','US-TX').values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('region','US-TX').values('code').fold().limit(local,2): {'values', 'fold'}\n",
      "g.V().has('region','US-TX').values('code').fold().tail(local,2): {'values', 'fold', 'tail'}\n",
      "g.V().has('country','US').dedup().by('region').values('region').order().fold(): {'values', 'fold'}\n",
      "g.V().has('country','US').values('region').order().fold().dedup(local): {'values', 'fold'}\n",
      "g.V().has('code','AUS').both().group().by(label).by(values('code').fold().dedup(local).order(local)): {'values', 'fold', 'group'}\n",
      "g.V().has('code','AUS').both().group().by(label).by(values('code').fold().dedup(local).order(local).limit(local,10)): {'values', 'fold', 'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()): {'group'}\n",
      "g.V().has('code','DFW').as('a').group().by().by(outE().count()).select('a'): {'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()).select(keys): {'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()).unfold().select(keys): {'unfold', 'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()).unfold().select(values): {'unfold', 'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()).unfold().select(keys).values('code'): {'unfold', 'values', 'group'}\n",
      "g.V().has('code','DFW').group().by().by(outE().count()).as('ct').addV('dfwcount').property('current_count',select('ct').unfold().select(values)): {'addV', 'unfold', 'group'}\n",
      "g.V(54931).valueMap(true): {'valueMap'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(values('runways')).order(local).by(values): {'values', 'group'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(values('runways')).unfold().select(values).sum(): {'unfold', 'values', 'group'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(values('runways')).local(select(values).sum(local)): {'values', 'group', 'local'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(values('runways')).unfold().select(values).sum().math('_ / 10'): {'math', 'unfold', 'values', 'group'}\n",
      "g.V().hasLabel('airport').limit(10).group().by('code').by(values('runways')).project('total','number').by(select(values).unfold().sum()).by(count(local)).math('total / number'): {'unfold', 'values', 'project', 'group', 'math'}\n",
      "g.V().has('region','US-NM').group().by('code').by(values('runways')): {'values', 'group'}\n",
      "g.V().has('region','US-AZ').group().by('code').by(values('runways')): {'values', 'group'}\n",
      "g.V().has('region','US-NM').group().by('code').by(values('runways')).select(values).unfold().sum().store('a').V().has('region','US-AZ').group().by('code').by(values('runways')).select(values).unfold().sum().store('b').project('first','second').by(select('a').unfold()).by(select('b').unfold()).math('first / second'): {'unfold', 'values', 'store', 'project', 'group', 'math'}\n",
      "g.V().has('code','SAF').out().values('runways').fold(): {'values', 'fold'}\n",
      "g.V().sack(assign).by(constant(1)).has('code','SAF').out().values('runways').sack(sum).sack().fold(): {'values', 'sack', 'fold', 'constant'}\n",
      "g.V().has('code','AUS').sack(assign).by('runways').V().has('code','SAF').out().sack(sum).by('runways').sack().fold(): {'sack', 'fold'}\n",
      "g.V().has('code','AUS').sack(assign).by('runways').V().has('code','SAF').out().sack(mult).by('runways').sack().fold(): {'sack', 'fold'}\n",
      "g.V().has('code','AUS').sack(assign).by('runways').V().has('code','SAF').out().sack(minus).by('runways').sack().fold(): {'sack', 'fold'}\n",
      "g.V().sack(assign).by(constant(-1)).has('code','SAF').out().values('runways').sack(sum).sack().fold(): {'values', 'sack', 'fold', 'constant'}\n",
      "g.V().sack(assign).by(constant(400)).has('code','SAF').outE().sack(min).by('dist').sack().fold(): {'sack', 'fold', 'constant'}\n",
      "g.V().sack(assign).by(constant(400)).has('code','SAF').outE().sack(max).by('dist').sack().fold(): {'sack', 'fold', 'constant'}\n",
      "g.V().has('code','SAF').repeat(outE().inV().simplePath()).times(2).limit(10).project('path','total').by(path().by('code').by('dist')).by(path().unfold().coalesce(values('dist'): {'project', 'values', 'unfold', 'coalesce'}\n",
      "g.V().has('code','SAF').repeat(outE().inV().simplePath()).times(2).limit(10).local(union(path().by('code').by('dist').unfold(): {'unfold', 'local', 'union'}\n",
      "g.V().has('code','AUS').repeat(out().simplePath()).until(has('code','WLG')).limit(10).local(union(path().by('code'): {'local', 'union'}\n",
      "g.V(3).sack(assign).by(constant(true)).sack(and).by(constant(false)).sack(): {'sack', 'constant'}\n",
      "g.V(3).sack(assign).by(constant(true)).sack(or).by(constant(false)).sack(): {'sack', 'constant'}\n",
      "g.addV('happy').property('happy',true): {'addV'}\n",
      "g.addV('sad').property('happy',false): {'addV'}\n",
      "g.V(3).sack(assign).by(constant(true)).sack(and).by(V().hasLabel('happy').values('happy')).sack().path(): {'values', 'sack', 'constant'}\n",
      "g.V(3).sack(assign).by(constant(true)).sack(and).by(V().hasLabel('sad').values('happy')).sack().path(): {'values', 'sack', 'constant'}\n",
      "g.V().has('airport','runways',gt(6)).values('code'): {'values'}\n",
      "g.V().has('region','US-OR').sideEffect{c+=1}.values('code').fold(): {'values', 'fold'}\n",
      "g.V().has('region','US-OR').values('code').count().next(): {'values'}\n",
      "g.V().has('region','US-OR').values('code').fill(oregon): {'fill', 'values'}\n",
      "g.V().hasLabel('airport').filter{it.get().property('city').value(): {'get'}\n",
      "g.V().has('runways',6).sideEffect{printit.get().values('code').next(): {'get', 'values'}\n",
      "g.V().hasLabel('airport').filter{it.get().value('city').startsWith('Dal'): {'get', 'startsWith'}\n",
      "g.V().hasLabel('airport').as('a').values('desc').filter{it.toString().contains('F.'): {'values', 'toString'}\n",
      "g.V().hasLabel('airport').limit(10).map(properties('city')): {'map'}\n",
      "g.V().hasLabel('airport').limit(10).map(properties('city').group().by(key()).by(value())): {'map', 'group', 'key'}\n",
      "g.V().hasLabel('airport').limit(10).map(properties('city').group().by(key()).by(value())).unfold().order().by(values,asc): {'map', 'unfold', 'group', 'key'}\n",
      "g.V().hasLabel('airport').limit(10).map(values('city')).fold(): {'map', 'values', 'fold'}\n",
      "g.V().hasLabel('airport').limit(10).values('city').fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').limit(10).id().fold(): {'id', 'fold'}\n",
      "g.V().hasLabel('airport').limit(10).map{it.get().id(): {'get', 'id'}\n",
      "g.V().hasLabel('airport').limit(10).map{a=1;b=2;c=a+b;it.get().id(): {'get', 'id'}\n",
      "g.V().has('code','SAF').out().values('runways').map{it.get(): {'get', 'values'}\n",
      "g.V().has('code','SAF').out().map{m=[:];m[it.get().values('code').next(): {'get', 'values'}\n",
      "g.V().has('code','SAF').map(out()): {'map'}\n",
      "g.V().has('code','SAF').flatMap(out()): {'flatMap'}\n",
      "g.V().has('code','AUS').flatMap(outE().inV()).path().by('city').limit(3): {'flatMap'}\n",
      "g.V().has('code','AUS').map(outE().inV()).path().by('city').limit(3): {'map'}\n",
      "g.V().has('code','AUS').repeat(flatMap(outE().has('dist',gt(2000)).inV())).times(2).path().limit(5): {'flatMap'}\n",
      "g.V().hasLabel('airport').filter{it.get().property('desc').value().contains('Dallas'): {'get'}\n",
      "g.V().has('airport','type','airport').filter{it.get().property('city').value==~/Dallas|Austin/}.values('code'): {'get', 'values'}\n",
      "g.V().has('airport','type','airport').filter{it.get().property('city').value(): {'get'}\n",
      "g.V().hasLabel('airport').values('longest').mean().next(): {'values'}\n",
      "g.V().hasLabel('airport').has('longest',test(f,a)).values('code'): {'test', 'values'}\n",
      "g.V().has('desc',test(f,/^Dal.*/)).values('desc'): {'test', 'values'}\n",
      "g.V().has('desc',regex(/^Dal.*/)).values('desc'): {'values', 'regex'}\n",
      "g.V().has('code','SFO').valueMap().map(unfold().group().by(keys).by(select(values).unfold())).unfold(): {'valueMap', 'map', 'unfold', 'group'}\n",
      "g.V().has('code','SFO').valueMap('region'): {'valueMap'}\n",
      "g.V().has('code','SFO').valueMap().map(unfold().group().by(keys).by(choose(select(values).count(local).is(1): {'unfold', 'choose', 'group', 'map', 'valueMap'}\n",
      "g.V().has('code','AUS').repeat(out()).times(2).tree().by('code').next(): {'tree'}\n",
      "g.V(1..46).outE().filter(inV().hasId(within(1L..46L))).subgraph('a').cap('a').next(): {'cap', 'subgraph'}\n",
      "g.V().has('code','AUS').bothE().subgraph('subGraph').cap('subGraph').next(): {'cap', 'subgraph'}\n",
      "g.V().has('code','AUS').outE('route').subgraph('subGraph').cap('subGraph').next(): {'cap', 'subgraph'}\n",
      "g.V().has('code','AUS').repeat(bothE().subgraph('subGraph').outV()).times(2).cap('subGraph').next(): {'cap', 'subgraph'}\n",
      "g.V().hasLabel('continent').has('code','EU').outE('contains').subgraph('eu-air-routes').inV().as('a').inE('contains').subgraph('eu-air-routes').outV().hasLabel('country').select('a').outE().as('r').inV().hasLabel('airport').in().hasLabel('continent').has('code','EU').select('r').subgraph('eu-air-routes').cap('eu-air-routes').next(): {'cap', 'subgraph'}\n",
      "g.V().has('code','LAX').valueMap(true,'code','city').next(): {'valueMap'}\n",
      "g.V().has('code','AUS').as('a').repeat(out().where(neq('a'))).times(1).simplePath().has('code','LAX').path().by('code').count().next(): {'neq', 'where'}\n",
      "g.V().has('code','AUS').as('a').repeat(out().where(neq('a'))).times(2).simplePath().has('code','LAX').path().by('code').count().next(): {'neq', 'where'}\n",
      "g.V().has('code','AUS').as('a').repeat(out().where(neq('a'))).times(3).simplePath().has('code','LAX').path().by('code').count().next(): {'neq', 'where'}\n",
      "g.V().has('code','AUS').as('a').repeat(out().where(neq('a'))).times(4).simplePath().has('code','LAX').path().by('code').count().next(): {'neq', 'where'}\n",
      "g.V().has('region','US-TX').out().has('region','US-CA').out().has('country','DE').profile(): {'profile'}\n",
      "g.V().has('airport','code','AUS').repeat(out()).until(has('code','AGR')).limit(10).path().by('code').profile(): {'profile'}\n",
      "g.V().has('code','IST').valueMap(true): {'valueMap'}\n",
      "g.V().hasLabel('country').not(out()).values('desc'): {'values'}\n",
      "g.V().hasLabel('country').where(out().count().is(0)).values('desc'): {'values', 'where'}\n",
      "g.V().hasLabel('country').where(__.not(out())).values('desc'): {'values', 'where'}\n",
      "g.V().hasLabel('airport').not(bothE('route')).values('code').fold(): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').where(out('route').count().is(gt(180))).values('code').fold(): {'values', 'where', 'fold'}\n",
      "g.V().hasLabel('airport').where(out('route').count().is(gt(180))).group().by('code').by(out().count()): {'where', 'group'}\n",
      "g.V().hasLabel('airport').where(out('route').count().is(gt(180))).group().by('code').by(out().count()).order(local).by(values,desc): {'where', 'group'}\n",
      "g.V().hasLabel('airport').where(both('route').count().is(gt(400))).values('code').fold(): {'values', 'where', 'fold'}\n",
      "g.V().hasLabel('airport').where(out().count().is(eq(1))).count(): {'eq', 'where'}\n",
      "g.V().hasLabel('airport').groupCount().by('runways').unfold().project('runways','count').by(keys).by(values): {'project', 'unfold', 'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by('runways').project('runways','count').by(keys).by(values): {'project', 'groupCount'}\n",
      "g.V().has('country','code','UK').out('contains').groupCount().by('region'): {'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by('country').order(local).by(values,desc): {'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by('country').order(local).by(keys,asc): {'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by('country').select('DE','CN','NL','US'): {'groupCount'}\n",
      "g.V().hasLabel('country').group().by('code').by(outE().count()).order(local).by(values,desc): {'group'}\n",
      "g.V().hasLabel('country').group().by('code').by(outE().count()).order(local).by(values,desc).tail(local,20): {'group', 'tail'}\n",
      "g.V().hasLabel('airport').out().groupCount().by('code'): {'groupCount'}\n",
      "g.V().hasLabel('airport').out().groupCount().by('code').select('AUS','AMS','JFK','DUB','MEX'): {'groupCount'}\n",
      "g.V().hasLabel('airport').group().by(out().count()).by('code').order(local).by(keys): {'group'}\n",
      "g.V().hasLabel('airport').group().by(out().count()).by('code').next().get(105L): {'get', 'group'}\n",
      "g.V(3).out().groupCount('a').by('runways').out().count().as('b').select('a','b'): {'groupCount'}\n",
      "g.V().has('airport','region','US-OK').groupCount('a').by(constant('OK')).cap('a'): {'cap', 'groupCount', 'constant'}\n",
      "g.V().has('airport','region','US-OK').groupCount().by('region'): {'groupCount'}\n",
      "g.V().hasLabel('airport').choose(has('runways',4): {'choose'}\n",
      "g.V().hasLabel(\"airport\").limit(5).group().by('code').by(out(\"route\").limit(5).group().by('code').by(out(\"route\").count())): {'group'}\n",
      "g.V().hasLabel(\"airport\").limit(5).group().by('code').by(out(\"route\").limit(5).group().by('code').by(out(\"route\").count())).select('ANC','ATL'): {'group'}\n",
      "g.V().hasLabel(\"airport\").limit(5).group().by('code').by(out(\"route\").limit(5).group().by('code').by(out(\"route\").count())).select('ANC').select('IAH','LAX'): {'group'}\n",
      "g.V().has('continent','code','EU').out().out().has('country','US').groupCount().by('code').order(local).by(values,asc): {'groupCount'}\n",
      "g.V().has('continent','code','EU').out().as('a').out().has('country','US').select('a').groupCount().by('code').order(local).by(values,asc): {'groupCount'}\n",
      "g.V().has('code','AUS').out('route').values('city').fold(): {'values', 'fold'}\n",
      "g.V().has('code','AUS').out('route').values('city').fold(0): {'values', 'fold'}\n",
      "g.V().hasLabel('airport').groupCount().by(out('route').count()).order(local).by(values,desc): {'groupCount'}\n",
      "g.V().hasLabel('airport').groupCount().by(out('route').count()).order(local).by(keys,asc): {'groupCount'}\n",
      "g.V().hasLabel('airport').union(count(): {'union'}\n",
      "g.V().has('type','airport').local(__.in('route').count()).mean(): {'local'}\n",
      "g.V().has('type','airport').local(both('route').count()).mean(): {'local'}\n",
      "g.V().has('region','GB-ENG').has('city','London').group().by('code').by(out().count()): {'group'}\n",
      "g.V().has('region','GB-ENG').has('city','London').aggregate('lon').out().out().dedup().where(without('lon')).count(): {'aggregate', 'where', 'without'}\n",
      "g.V().has('region','GB-ENG').order().by('code').aggregate('a').out().where(within('a')).path().by('code'): {'aggregate', 'where'}\n",
      "g.V().has('region','GB-ENG').order().by('code').as('a').out().has('region','GB-ENG').as('b').where('a',lt('b')).by('code').path().by('code'): {'where'}\n",
      "g.V().has('airport','runways',gte(6)).values('code','runways').fold(): {'values', 'fold'}\n",
      "g.V().has('airport','runways',gte(6)).local(values('code','runways').fold()): {'values', 'fold', 'local'}\n",
      "g.V().where(outE().count().is(0)).count(): {'where'}\n",
      "g.V().has('code','AUS').repeat(out().has('code',without('YYZ')).dedup()).until(has('code','YPO')).path().by('code'): {'without'}\n",
      "g.V().has('code','FLL').out().as('a').in('contains').has('code','EU').select('a').values('city'): {'values'}\n",
      "g.V().has('code','DEN').out().has('country','MX').values('city'): {'values'}\n",
      "g.V().has('city',within('London','Munich','Paris')).aggregate('a').out().where(within('a')).path().by('code'): {'aggregate', 'where'}\n",
      "g.V().has('code','LGW').outE().where(values('dist').is(gt(4000L))).inV().path().by('code').by('dist').by('city'): {'values', 'where'}\n",
      "g.V().hasLabel('airport').has('code','DFW').outE().has('dist',gt(4500)).as('e').inV().as('c').select('e','c').by('dist').by('code').sort(): {'sort'}\n",
      "g.V().as('a').outE().has('dist',gt(8000)).inV().as('b').filter(select('a','b').by('code').where('a',lt('b'))).path().by('code').by('dist'): {'where'}\n",
      "g.V().as('a').outE().has('dist',gt(8000)).order().by('dist',desc).inV().as('b').filter(select('a','b').by('code').where('a',lt('b'))).path().by('code').by('dist'): {'where'}\n",
      "g.V().as('s').outE().has('dist',gt(8000)).order().by('dist',desc).inV().as('f').where('f',lt('s')).by('code').path().by('code').by('dist'): {'where'}\n",
      "g.V().as('s').outE().has('dist',gt(8000)).order().by('dist',desc).inV().as('f').where('f',gt('s')).by('code').path().by('code').by('dist'): {'where'}\n",
      "g.E().hasLabel('route').order().by('dist',desc).limit(40).project('a','b','c').by(inV().values('code')).by('dist').by(outV().values('code')).filter(select('a','c')).where('a',lt('c')): {'project', 'where', 'values'}\n",
      "g.V().hasLabel('airport').as('a').outE().as('b').order().by('dist',desc).limit(40).inV().as('c').where('a',lt('c')).by('code').select('a','b','c').by('code').by('dist'): {'where'}\n",
      "g.V().hasLabel('airport').limit(10).local(outE().order().by('dist',desc).inV().path().by('code').by('dist').limit(1)): {'local'}\n",
      "g.V().has('city',within('London','Munich','Paris')).aggregate('a').outE().union(values('dist').sum(): {'aggregate', 'values', 'union'}\n",
      "g.V().has('code','AUS').outE().as('e').inV().has('code','MEX').select('e').values('dist'): {'values'}\n",
      "g.V().hasLabel('airport').where(out().count().is(gt(200))).group().by('code').by(outE().count()): {'where', 'group'}\n",
      "g.V().hasLabel('airport').where(out().count().is(gt(200))).group().by('code').by(outE().count()).order(local).by(values): {'where', 'group'}\n",
      "g.V().has('code','AUS').sack(assign).by(constant(0)).out().sack(sum).by('runways').sack().sum(): {'sack', 'constant'}\n",
      "g.V().filter(values('lat').is(gt(77))).valueMap('city','lat'): {'valueMap', 'values'}\n",
      "g.V().has('lat',gt(77)).valueMap('city','lat'): {'valueMap'}\n",
      "g.V().has('lat',outside(-50,77)).order().by('lat',asc).valueMap('city','lat'): {'valueMap', 'outside'}\n",
      "g.V().has('airport','code','LHR').valueMap('lat','lon'): {'valueMap'}\n",
      "g.V().has('airport','city','London').has('region','GB-ENG').valueMap('code','lat','lon'): {'valueMap'}\n",
      "g.V().hasLabel('airport').has('lon',between(-0.1,0.1)).valueMap('code','lon'): {'between', 'valueMap'}\n",
      "g.V().hasLabel('airport').has('lat',between(-0.1,0.1)).valueMap('code','lat'): {'between', 'valueMap'}\n",
      "g.V().has('code','LHR').values('lat').next(): {'values'}\n",
      "g.V().has('code','LHR').values('lon').next(): {'values'}\n",
      "g.V().hasLabel('airport').where(and(values('lon').is(between(lon-1,lon+1)): {'between', 'values', 'where'}\n",
      "g.V().hasLabel('airport').has('lon',between(lon-1,lon+1)).has('lat',between(lat-1,lat+1)).valueMap('code','lat','lon'): {'between', 'valueMap'}\n",
      "g.V().has('airport','code','AUS').as('aus').out().has('country',within('US','CA')).where(lt('aus')).by('lon').has('code',without('PHX','LAX')).out().has('code','LAS').path().by('code'): {'where', 'without'}\n",
      "g.V().has('code','DFW').values('lon').next(): {'values'}\n",
      "g.V().has('airport','code','AUS').as('aus').out().has('country',within('US','CA')).has('lon',lte(dfw)).has('code',without('PHX','LAX')).out().has('code','LAS').path().by('code'): {'without'}\n",
      "g.V().has('airport','code','DFW').out().has('country','US').group().by('region').by('code').select('US-CA','US-TX','US-FL','US-CO','US-IL').unfold(): {'unfold', 'group'}\n",
      "g.V().hasId(between(1,201)).values('city').order().fold(): {'between', 'values', 'fold'}\n",
      "g.V().hasId(between(1,201)).values('city').order().count(): {'between', 'values'}\n",
      "g.V().hasId(between(1,201)).values('city').dedup().count(): {'between', 'values'}\n",
      "g.addV(\"A\").as(\"a\").addV(\"B\").as(\"b\").addV(\"C\").as(\"c\").addV(\"D\").as(\"d\").addV(\"E\").as(\"e\").addV(\"F\").as(\"f\").addE(\"knows\").from(\"a\").to(\"b\").addE(\"knows\").from(\"a\").to(\"c\").addE(\"knows\").from(\"a\").to(\"d\").addE(\"knows\").from(\"c\").to(\"d\").addE(\"knows\").from(\"c\").to(\"e\").addE(\"knows\").from(\"d\").to(\"f\"): {'addV', 'addE', 'from', 'to'}\n",
      "g.V().valueMap(true): {'valueMap'}\n",
      "g.addV().property(label,V().has('code','DFW').label()): {'addV'}\n",
      "g.V().has('code','DFW').as('dfw').addV().property(label,select('dfw').label()): {'addV'}\n",
      "g.V(57525).valueMap(true): {'valueMap'}\n",
      "g.V().has('code','DFW').as('dfw').addV().property(label,select('dfw').label()).as('new').property(select('dfw').properties().key(): {'addV', 'key'}\n",
      "g.V(53767).valueMap(true).unfold(): {'unfold', 'valueMap'}\n",
      "g.V(53767).drop(): {'drop'}\n",
      "g.V().has('code','DFW').as('dfw').addV().property(label,select('dfw').label()).as('new').select('dfw').properties().as('dfwprops').select('new').property(select('dfwprops').key(): {'addV', 'key'}\n",
      "g.V(53768).valueMap(true).unfold(): {'unfold', 'valueMap'}\n",
      "g.V(53768).drop(): {'drop'}\n",
      "g.V().has('code','DFW').as('dfw').addV().property(label,select('dfw').label()).as('new').sideEffect(select('dfw').properties().as('dfwprops').select('new').property(select('dfwprops').key(): {'addV', 'key'}\n",
      "g.V(53780).valueMap(true).unfold(): {'unfold', 'valueMap'}\n",
      "g.addV('root').property('data',9).as('root').addV('node').property('data',5).as('b').addV('node').property('data',2).as('c').addV('node').property('data',11).as('d').addV('node').property('data',15).as('e').addV('node').property('data',10).as('f').addV('node').property('data',1).as('g').addV('node').property('data',8).as('h').addV('node').property('data',22).as('i').addV('node').property('data',16).as('j').addE('left').from('root').to('b').addE('left').from('b').to('c').addE('right').from('root').to('d').addE('right').from('d').to('e').addE('right').from('e').to('i').addE('left').from('i').to('j').addE('left').from('d').to('f').addE('right').from('b').to('h').addE('left').from('c').to('g'): {'addV', 'addE', 'from', 'to'}\n",
      "g.V().hasLabel('root').repeat(out('right')).until(out('right').count().is(0)).values('data'): {'values'}\n",
      "g.V().hasLabel('root').repeat(out('left')).until(out('left').count().is(0)).values('data'): {'values'}\n",
      "g.V().hasLabel('root').repeat(out('left')).until(__.not(out('left'))).values('data'): {'values'}\n",
      "g.V().hasLabel('root').repeat(out('left')).emit().values('data'): {'values'}\n",
      "g.V().hasLabel('root').repeat(out()).emit().tree().by('data').next(): {'tree'}\n",
      "g.V().has('airport','region','GB-ENG').limit(10).map{it.get().value('code'): {'get'}\n",
      "g.V().has('code','AUS').repeat(bothE('route').sample(1).by('dist').otherV()).times(5).path().by('code').by('dist'): {'otherV', 'sample'}\n",
      "g.V().hasLabel('airport').sample(1).repeat(bothE('route').sample(1).by('dist').otherV()).times(5).path().by('code').by('dist'): {'otherV', 'sample'}\n",
      "g.V().hasLabel('airport').repeat(local(bothE('route').sample(1).by('dist').otherV())).times(5).path().by('code').by('dist').limit(5): {'otherV', 'local', 'sample'}\n",
      "g.V().has('airport','code',neq('LHR')).filter(out('route').count().is(neq(0))).local(union(identity().values('code'): {'neq', 'values', 'local', 'union'}\n",
      "g.V().has('airport','code',neq('AUS')).filter(out('route').count().is(neq(0))).local(repeat(out().simplePath()).emit(has('code','AUS')).times(10).limit(1)).path().by('code').where(count(local).is(gte(8))): {'neq', 'where', 'local'}\n",
      "g.V().has('airport','code',neq('AUS')).filter(out('route').count().is(neq(0))).local(repeat(out().simplePath()).until(has('code','AUS').or().loops().is(8)).has('code','AUS').limit(1)).path().by('code').where(count(local).is(gte(8))): {'neq', 'loops', 'where', 'local'}\n",
      "g.V().has('code','AUS').repeat(out().where(without('a')).store('a')).times(7).path().by('code'): {'where', 'without', 'store'}\n",
      "g.V().has('code','LHR').out().groupCount().by('code').order(local).by(values,desc).next().values().max(): {'values', 'groupCount'}\n",
      "g.V().has('code','LHR').out().groupCount().by('code').order(local).by(values,desc): {'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").groupCount().by(select(\"a\",\"b\")): {'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").groupCount().by(select(\"a\",\"b\")).unfold().filter(select(values).is(gt(1))): {'unfold', 'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").groupCount().by(select(\"a\",\"b\")).unfold().filter(select(values).is(gt(1))).select(keys): {'unfold', 'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").select('a','b').by('code').groupCount().unfold().filter(select(values).is(gt(1))): {'unfold', 'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").select('a','b').by('code').groupCount().unfold().filter(select(values).is(gt(1))).select(keys): {'unfold', 'groupCount'}\n",
      "g.V().as(\"a\").out().as(\"b\").select('a','b').by('code').groupCount().unfold().filter(select(values).is(gt(1))).select(keys).select(values): {'unfold', 'groupCount'}\n",
      "g.V().has('code','AUS').addE('route').to(V().has('code','CUN')): {'to', 'addE'}\n",
      "g.V().has('code','AUS').out().groupCount().by(path().by('code')).limit(local,5): {'groupCount'}\n",
      "g.E().hasLabel('route').as('e').values('dist').max().select('e'): {'values'}\n",
      "g.E().hasLabel('route').values('dist').max().next(): {'values'}\n",
      "g.E().has('dist',r).bothV().values('code'): {'values'}\n",
      "g.E().hasLabel('route').as('e').order().by('dist',desc).limit(1).select('e').id().next(): {'id'}\n",
      "g.E(r).distg.E(r).bothV().values('code'): {'values'}\n",
      "g.E().hasLabel(\"route\").order().by(\"dist\",desc).store(\"d\").by(\"dist\").filter(values(\"dist\").as(\"cd\").select(\"d\").by(limit(local,1)).as(\"md\").where(\"cd\",eq(\"md\"))).project(\"from\",\"to\",\"dist\").by(outV()).by(inV()).by(\"dist\"): {'where', 'values', 'store', 'project', 'eq'}\n",
      "g.E().hasLabel(\"route\").order().by(\"dist\",desc).store(\"d\").by(\"dist\"): {'store'}\n",
      "g.V().hasLabel('airport').where(out().count().is(gt(500/2))).values('code'): {'values', 'where'}\n",
      "g.V().hasLabel('airport').where(out().count().is(gt(a/2))).values('code'): {'values', 'where'}\n",
      "g.V().local(out('route').count()).max().next(): {'local'}\n",
      "g.V().hasLabel('airport').where(out().count().is(gt(a-50))).project('apt','routes').by('code').by(out().count()): {'project', 'where'}\n",
      "637 queries contain steps not in PyMogwai\n"
     ]
    }
   ],
   "source": [
    "query_step_map = {query: steps_pattern.findall(query) for query in queries}\n",
    "counter = 0\n",
    "for query, steps in query_step_map.items():\n",
    "\tif len(set(steps)-steps_in_pymogwai)>0:\n",
    "\t\tcounter += 1\n",
    "\t\tprint(f\"{query}: {set(steps)-steps_in_pymogwai}\")\n",
    "print(f\"{counter} queries contain steps not in PyMogwai\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Saved 204 queries\n"
     ]
    }
   ],
   "source": [
    "with open(\"queries.txt\", \"w\") as f:\n",
    "\tcounter = 0\n",
    "\tfor query, steps in query_step_map.items():\n",
    "\t\tif len(set(steps)-steps_in_pymogwai)==0:\n",
    "\t\t\tcounter += 1\n",
    "\t\t\tf.write(f\"{query}\\n\")\n",
    "\tprint(f\"Saved {counter} queries\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Testing wrappers"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Any, Callable\n",
    "def parameterizable_step(func:Callable):\n",
    "    def check_is_hello(x:Any):\n",
    "        if x == 'hello':\n",
    "            return True\n",
    "        elif isinstance(x, (list,tuple)):\n",
    "            return any(check_is_hello(i for i in x))\n",
    "        elif isinstance(x, dict):\n",
    "            return any(check_is_hello(i for i in x.values()))\n",
    "        return False\n",
    "\n",
    "    def wrapper(instance, *args, **kwargs):\n",
    "        if check_is_hello(args) or check_is_hello(kwargs):\n",
    "            #use a parameter\n",
    "            return instance._sayhello(*args, **kwargs)\n",
    "        else: return func(*args, **kwargs)\n",
    "    return wrapper\n",
    "\n",
    "class Test:\n",
    "\t@parameterizable_step\n",
    "\tdef _sayhello(self, *args, **kwargs):\n",
    "\t\tprint(\"Hello\", args, kwargs)\n",
    "\n",
    "\tdef sayhello(self, *args, **kwargs):\n",
    "\t\tprint(args, kwargs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "py3env",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
